const Nitross = require('../events');
const { MessageType, MessageOptions, Mimetype } = require('@adiwajshing/baileys');
const fs = require('fs');
const axios = require('axios');
const Config = require('../config');
const gk = "සාමාන්‍ය දෑනීමට"; 

//private

Nitross.addCommand({ pattern: 'knowledge ?(.*)', fromMe: true, desc: gk}, (async (message, match) => {

	var respoimage = await axios.get(`https://telegra.ph/file/5929ee1dbf1109c562b04.jpg`, { responseType: 'arraybuffer' })

	await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 
		`╔════💢Nitross💢════╗
         ‖ GENARAL KNOWLEDGE ‖
          ═══════════════════


 💌1.command - gk1

      about - නයගරාව සුන්දර කරන මල් ඔරලෝසුව

 💌2.command - gk2

      about - සර්පයන්
      
 💌3.ommand - gk3

      about - අසිරිමත් මිනිස් මොළය...           

 💌4.command - gk4

      about - ලෝකයේ කැපී පෙනෙන විප්ලව

 💌5.command - gk5

      about - ලොව විශාලතම වැසි වනාන්තර 6ක්

 💌6.command - gk6

      about - ආහාර ජීර්ණ පද්ධතිය

 💌7.command - gk7

      about - කුණ කටුවා

 💌8.command - gk8

      about - නයගරා දිය ඇල්ල

 💌9.command - gk9

      about - කිංග් කෝබ්‍රා
      
 💌10.command - gkr10

      about - මහත් මා ගාන්ධි


💢තවත් බොහෝ විස්තර ළගදීම ඇතුලත් වේ.💢        
`
	})


    }));

Nitross.addCommand({pattern: 'gk1 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/7b8efabb1280e5560ab8c.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	-----නයගරාව සුන්දර කරන මල් ඔරලෝසුව-------
    	         ————————————————————————————


කැනඩාව සහ ඇමරිකා එක්සත් ජනපදය උතුරු ඇමරිකා මහද්වීපය තුළ පිහිටා තිබෙන විශාලතම රටවල් ද්විත්වය යි. එම රටවල් දෙක වෙන් වන දේශ සීමාවේ සුප්‍රකට නයගරා දිය ඇල්ල පිහිටා තිබෙනවා. ලොව දක්නට ලැබෙන සුන්දරම දිය ඇලි අතුරින් එකක් වන නයගරා ඇල්ල නැරඹීමට සංචාරකයන් විශාල වශයෙන් පැමිණෙනවා. එම සංචාරකයන් නයගරාවේ සුන්දරත්වය විඳගැනීමෙන් පසුව අනිවාර්යයෙන්ම නරඹන තවත් ස්ථානයක් තිබෙනවා. ඒ නයගරා උද්‍යානය තුළ පිහිටා තිබෙන අලංකාර මල් ඔරලෝසුව යි.


දිය ඇලි තුනක් එකතු වී සෑදුණු නයගරා ඇල්ල 

ඊරි විලේ සිට ඔන්ටේරියෝ විල දක්වා ජලය රැගෙන යන නයගරා ගංඟාවෙන් හෝර්ස්ෂූ, බ්‍රයිඩ්ල් වේල්, සහ ඇමරිකන් යන දිය ඇලි ත්‍රිත්වය නිර්මාණය වී තිබෙනවා. එම දිය ඇලි එකතු වීමෙන් සෑදී ඇති නයගරා දිය ඇල්ල උසින් මීටර් 51ක් සහ පළලින් මීටර් 1204ක් වන විට එහි ජල ඝනත්වය තත්පරයට මීටර් 2400ක් පමණ වනවා. මීට වසර 18000කට පමණ පෙර පැවති අයිස් යුගයේ දී මෙම ප්‍රදේශය ඝනකම් අයිස් තට්ටුවකින් වැසී තිබුණා. එම අයිස් තට්ටුව දියවීම හේතුවෙන් පංච මහා විල් සහ නයගරා ගඟ නිර්මාණය වුණා. ඉන් අනතුරුව නිර්මාණය වුණු නයගරා දිය ඇල්ල වසර 12000ක් පමණ පැරණි යි. රටවල් දෙකක් වෙන් කරන නයගරා දිය ඇල්ලට ආසන්නයෙන් පිහිටා තිබෙන ප්‍රධාන නගර වන්නේ ඔන්ටේරියෝ සහ නිව්යෝක් යන නගර දෙක යි.


මල් ඔරලෝසුව පිහිටා තිබෙන ස්ථානය 

නයගරා දිය ඇල්ලේ සිට ඔන්ටේරියෝ නගරය දෙසට කි. මී. 10ක් පමණ ගිය විට ඇඩම් බෙක් පළමු සහ දෙවන බලාගාර හමුවනවා. ඉන් ඇඩම් බෙක් පළමු බලාගාරය 1922 වසරේ දීත්, දෙවන බලාගාරය 1954 වසරේ දීත් ඉදිකර තිබෙනවා. ඊට අමතරව එම ප්‍රදේශය ආසන්නයේ ඔන්ටේරියෝ බලාගාරය පිහිටා තිබෙන ආකාරය දැකිය හැකියි. නව ඔන්ටේරියෝ බලාගාරය 1999 වසරේ දී ඉදිකර තිබුණත් ඊට පෙර එම ප්‍රදේශයේ පැරණි ඔන්ටේරියෝ බලාගාරයක් ක්‍රියාත්මක වුණා. 1906 වසරේ ආරම්භ කළ එම බලාගාරය 1999 වසරේ දී අක්‍රීය කරනු ලැබුවා. එම බලාගාර කිහිපය ආසන්නයේ ඉදිකර ඇති නයගරා උද්‍යානය තුළ සුප්‍රසිද්ධ නයගරා මල් ඔරලෝසුව නිර්මාණය කර තිබෙනවා.


මල් ඔරලෝසුවේ ඉතිහාසය

1940 දශකයේ අග භාගය වන විට ආචාර්ය රිචඩ් ලැන්කැස්ටර් හර්න් නම් ඉංජිනේරුවා පැරණි ඔන්ටේරියෝ බලාගාරයේ කළමනාකරු මෙන්ම ප්‍රධාන ඉංජිනේරුවරයා ලෙසින් කටයුතු කළා. පැරණි ඔන්ටේරියෝ බලාගාරය අසල පිහිටා තිබුණු සුන්දර නයගරා උද්‍යානය තුළ මල් ඔරලෝසුවක් ඉදිකිරීම පිළිබඳව මුලින්ම කල්පනා කළේ ලැන්කැස්ටර් ඉංජිනේරුවා යි. 1885 වසරේ දී ආරම්භ කළ නයගරා උද්‍යානය තුළ එවැනි මල් ඔරලෝසුවක් ඉදිකිරීමේ අදහස ඔහුට පහළ වුණේ එඩින්බරෝ මල් ඔරලෝසුව දැකීමෙන් පසුව යි. 1903 වසරේ දී ස්කොට්ලන්තයේ එඩින්බරෝ නුවර ඉදි කළ එය ලොව පැරණිම මල් ඔරලෝසුව බවට පත් වුණා. 

එඩින්බරෝ මල් ඔරලෝසුව අධ්‍යයනය කළ රිචඩ් ලැන්කැස්ටර් ඊට වඩා විශාල ඔරලෝසුවක් නයගරා උද්‍යානයේ ඉදිකරනු ලැබුවා. 1950 වසරේ දී වැඩ නිමා කළ එම මල් ඔරලෝසුව අයත් වුණේ පැරණි ඔන්ටේරියෝ බලාගාරයට යි. එම නිසා ඔරලෝසුවේ මුහුණතේ ඉලක්කම් 12 වෙනුවට ONTARIO HYDRO යන අකුරු 12 සටහන් කර තිබුණා. නමුත් 1977 වසරේ දී නයගරා උද්‍යානයට ඔරලෝසුවේ නඩත්තු කටයුතු භාරදීමත් සමගම එහි NIAGARA PARKS යනුවෙන් සටහන් කරනු ලැබුවා. එම නිසා වර්තමානය වන විට මල් ඔරලෝසු මුහුණතේ සටහන් කර තිබෙන්නේ NIAGARA PARKS යන අකුරු 12යි.


ඔරලෝසුව පිළිබඳව තවදුරටත්

එඩින්බරෝ මල් ඔරලෝසුවේ විෂ්කම්භය අඩි 10ක් වන විට මෙම මල් ඔරලෝසුවේ විෂ්කම්භය අඩි 40ක් පමණ වනවා. නයගරා මල් ඔරලෝසුවේ අඩි 38ක් පමණ පළලින් යුත් භූමි ප්‍රදේශයක් පුරා විවිධ මල් වර්ග දක්නට ලැබෙනවා. එසේම ඔරලෝසුව වටා තිබෙන ජල උද්‍යානය එහි අලංකාරය තවත් වැඩිකර තිබෙනවා. නයගරා මල් ඔරලෝසු මුහුණත තුළ සුදුසු ආකාරයට මල් වර්ග වැවීම කරනු ලබන්නේ නයගරා උද්‍යානයේ සිටින උද්භිද විද්‍යාඥයන්ගේ අධීක්ෂණය යටතේ යි. සාමාන්‍යයෙන් මෙම ඔරලෝසුවට යොදාගන්නා මල් පැළවල ස්වරූපය වසරකට දෙවරක් වෙනස් කරයි. ඒ අනුව සිසිර සමයේ අළු පාටින් පැහැයෙන් දිස්වන මල් ඔරලෝසුව වසන්තයේ දී හරිත පැහැයෙන් දිස්වන්නේ වියෝලා මල් නිසා යි. දළ වශයෙන් මල් පැළ 24000 කින් පමණ සමන්විත මෙම ඔරලෝසුව වඩාත් අලංකාර වන්නේ එහි සිටුවා ඇති සියළුම පැළවල මල් හටගැනීමෙන් පසුව යි.  


භාවිතා කර තිබෙන තාක්ෂණය

මෙම ඔරලෝසු මුහුණත තුළ දක්නට ලැබෙන පැය කටුව අඩි 14.5ක දිගකින් යුක්ත වන විට මිනිත්තු කටුව අඩි 17.5ක දිගකට සාදා තිබෙනවා. ඊට අමතරව මෙහි මුහුණතේ දක්නට ලැබෙන තත්පර කටුව අඩි 21ක පමණ දිගකට නිර්මාණය කර තිබෙන ආකාරය නිරීක්ෂණය කළ හැකියි. එසේම මෙම ඔරලෝසුවේ කටු තුනෙහි බර රාත්තල් 1250ක් පමණ වනවා. ශබ්දවාහීනී යන්ත්‍රයක් මඟින් සෑම විනාඩි 15කට වරක්ම මෙහි ඔරලෝසු නාදය විසුරුවා හරිනවා. එම කාර්යය සඳහා අශ්වබල 5කින් යුත් යන්ත්‍රයක් භාවිතා කරනවා. මෙහි ඔරලෝසු යාන්ත්‍රණය තෙල්වල ධාවනය වන අතර එය 2 hp-three-phase squirrel cage මෝටරයක් මඟින් මෙහෙයවනු ලබනවා. නමුත් දැන් එය 1500 RPM synchronous මෝටරයකින් ක්‍රියා කළ හැකි ආකාරයට සකස් කර තිබෙනවා. නයගරා මල් ඔරලෝසුව නිර්මාණය කළ අවධියේ එහි සියළුම තාක්ෂණික කටයුතු සිදුකරනු ලැබුවේ පැරණි ඔන්ටේරියෝ බලාගාරයේ කාර්යය මණ්ඩලයයි.

දැනට වසර 43ක සිට නයගරා මල් ඔරලෝසුව නඩත්තු කරන්නේ නයගරා උද්‍යානයේ කාර්යය මණ්ඩලය යි. මෙම මල් ඔරලෝසුවේ මුල් අයිතිකරුවන් වුණු පැරණි ඔන්ටේරියෝ බලාගාරය අද එහි දක්නට නැහැ. එසේම මෙය නිර්මාණය කළ ඉංජිනේරුවරයා වුණු  රිචඩ් ලැන්කැස්ටර් ද අද ජීවතුන් අතර නැහැ. නයගරා මල් ඔරලෝසුව සෑදීමට දායක වුණු සියළුදෙනාම අද ජීවතුන් අතර නොසිටියත් ඔවුන් කළ විශිෂ්ට නිර්මාණය තව දිගු කලක් යන තුරු නොනැසී පවතිනු ඇති.
`})

    }));

Nitross.addCommand({pattern: 'gk2 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var r_text = new Array ();
    
    
    r_text[0] = "https://telegra.ph/file/14f1d4a9cd8cdc075f144.jpg";
    r_text[1] = "https://telegra.ph/file/1ec8362bbd05ccd78c88a.jpg";
    r_text[2] = "https://telegra.ph/file/1caf3461d2a192345baf4.jpg";
    r_text[3] = "https://telegra.ph/file/000a4cdecca0d792d5c82.jpg";

    var i = Math.floor(5*Math.random())

    var respoimage = await axios.get(`${r_text[i]}`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	සර්පයන් දිගටි, අසරණ, මාංශ භක්ෂක උරගයින් වන උප සර්පයින් / සර්පන්ටිස් /. අනෙක් සියලුම චතුරස්රයන් මෙන් සර්පයන් අස්ථි, ඇම්නියොට් පෘෂ් b වංශීන් අතිච්ඡාදනය වන පරිමාණයන්ගෙන් ආවරණය වී ඇත. බොහෝ සර්ප විශේෂවල කටුස්සන්ගේ මුතුන් මිත්තන්ට වඩා සන්ධි කිහිපයක් ඇති අතර ඔවුන්ගේ හිසට වඩා විශාල ගොදුරක් ඔවුන්ගේ ජංගම හකු වලින් ගිල දැමීමට හැකි වේ. ඔවුන්ගේ පටු සිරුරු නවාතැන් ගැනීම සඳහා සර්පයන්ගේ යුගල අවයව (වකුගඩු වැනි) එක පැත්තකින් නොව එකින් එක ඉදිරියෙන් දිස්වන අතර බොහෝ දෙනෙකුට ඇත්තේ එක් ක්‍රියාකාරී පෙනහළු පමණි. සමහර විශේෂයන් සළුවෙහි දෙපැත්තේම නියපොතු යුගලයක් සහිත ශ්‍රෝණි ඉඟ පටියක් රඳවා ගනී. කටුස්සන්ගේ අත් පා නොමැතිව දිගටි සිරුරු පරිණාමය වී ඇති අතර අවයව පරිණාමය හරහා ස්වාධීනව විසිපස් ගුණයක් පමණ අවයවයන් අඩු වී ඇත. මේවා සර්පයන්ට සමාන ය, නමුත් කකුල් නැති කටුස්සන්ගේ පොදු කණ්ඩායම් කිහිපයකට ඇසිපිය හා බාහිර කන් ඇති අතර, සර්පයන් නොමැති නමුත් මෙම නියමය විශ්වීය නොවේ.
ජීවමාන සර්පයන් ඇන්ටාක්ටිකාව හැර සෑම මහද්වීපයකම දක්නට ලැබේ. ව්‍යතිරේකයන් අතර අයර්ලන්තය, අයිස්ලන්තය, ග්‍රීන්ලන්තය, හවායි දූපත් සමූහය සහ නවසීලන්ත දූපත් මෙන්ම අත්ලාන්තික් හා මධ්‍යම පැසිෆික් සාගරයේ කුඩා දූපත් ද ඇතුළත් වේ. මීට අමතරව, ඉන්දියානු සහ පැසිෆික් සාගර පුරා මුහුදු සර්පයන් බහුලව දක්නට ලැබේ. පවුල් 20 කට වැඩි ප්‍රමාණයක් සහ විශේෂ 3,900 කින් සමන්විත පවුල් විස්සකට වැඩි ප්‍රමාණයක් දැනට හඳුනාගෙන ඇත. සෙන්ටිමීටර 10.4 ක් දිග (අඟල් 4.1) බාබඩෝස් නූල් [6] සිට මීටර් 6.95 (අඩි 22.8) ක දිගකින් යුත් පයිතන් දක්වා ඒවා විශාල වේ. [7] ටයිටනොබෝවා සෙරෙජොනෙන්සිස් නම් පොසිල විශේෂයේ දිග මීටර් 12.8 (අඩි 42) කි. සර්පයන් පරිණාමය වී ඇත්තේ බුරාසිං හෝ ජලජ කටුස්සන්ගෙන් විය හැක, සමහර විට ජුරාසික් යුගයේදී, පැරණිතම පැරණිතම ෆොසිල 143 ත් 167 ත් අතර කාලයට අයත් වේ. [9] [10] නූතන සර්පයන්ගේ විවිධත්වය පැලියොසීන් යුගයේ දී දක්නට ලැබුණි (ක්‍රි.පූ. 66 සිට 56 Ma ට පෙර, ක්‍රිටේසියස්-පැලියෝජීන් වඳවීමේ සිදුවීමෙන් පසුව). සර්පයන් පිළිබඳ පැරණිතම විස්තර කර ඇත්තේ බෘක්ලින් පැපිරස්හි ය.

සර්ප විශේෂ බොහොමයක් අනාරක්ෂිත වන අතර විෂ ඇති අය එය මූලික වශයෙන් භාවිතා කරන්නේ ආත්මාරක්ෂාව සඳහා නොව ගොදුර මරා දැමීමට සහ යටත් කර ගැනීමට ය. සමහරුන්ට මිනිසුන්ට වේදනාකාරී තුවාල හෝ මරණයක් සිදු කිරීමට තරම් විෂ සහිත විෂ ඇත. අවිධිමත් සර්පයන් ගොදුරු පණපිටින් ගිල දමයි
`})

    }));

Nitross.addCommand({pattern: 'gk3 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/eda74c45628561c497561.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	අසිරිමත් මිනිස් මොළය...
         =====================

මිනිස් මොළය ස්නායු පද්ධතිය තුළ වැදගත් අවයවයක් වන අතර ඉතා සංකීර්ණතාවකින් යුතු අවයවයකි.

මිනිස් මොළය මධ්‍ය ස්නායු පද්ධතිය (කපාල හා සුසුම්නාව අඩංගු) පර්යන්ත ස්නායු පද්ධතිය ස්නායු පද්ධතිය පාලනය කරන අතර සෑම ක්‍රියාකරීත්වයක්ම පාලනය කෙරේ. අනිච්ඡානුග හෝ අඩු මට්ටමේ ක්‍රියාවන් (හෘද ස්පන්දන වේගය, ශ්වසනය, ආහාර ජීර්ණය, ඉච්ඡානුග පාලනයකින් තොරව මොළයෙන් සිදුවේ. විශේෂයෙන්ම ස්වයං සාධක ස්නායු පද්ධතිය මඟිනි. සංකීර්ණ හා උසස් මානසික ක්‍රියා (සිතීම, හේතු දැක්වීම, තේරුම් ගැනීම ආදී ඉච්ඡානුගව පාලනය වේ. කාය විවච්ඡේද විද්‍යාව අනුව කොටස් 3ක පෙර මොළය, මැද මොළය, පසු මොළය. පෙර මොළයෙහි නම් වූ මස්තිෂ්ක චලිතයෙහි ඛණ්ඩිකා කිහිපයක් ඇති අතර උසස් කෘත්‍යයන් පාලනය කරයි. මැද හා පසු මොළය අනිච්ඡානුග කෘත්‍යයන් සිදු කරයි. කපාලකරණයේ දී අනෙක් විශේෂවලට වඩා මිනිස් මොළය ශරීරයට සාපේක්ෂව ඉහළයි. පූර්ව මස්තිශ්කයේදී මෙම සිද්ධිය ප්‍රකටව දැක්වේ. පූර්ව මස්තිශ්කය භාෂාව හා සිහිය පිළිබඳ සොයා බැලේ. මෙය මානව මොළයෙන් 76% පමණ කොටසකින් යුතුයි. අනෙක් සත්වයන්ට වඩා විශාල වූ නියෝකොටෙක් නිසා මානවයන්ටම විශේෂිත වූ මානසික හැකියාවන් (ආදී විශේෂවලට සමාන වූ ස්නායු වාස්තු විද්‍යාවක් තිබුණ ද) සෑදීමට හැකියාව ඇත. උත්තේජවලට ප්‍රතිචාර දැක්වීමට මානවයන්ගේ ඇති පද්ධති, පාරිසරික සංවේදන, සමස්ථිතිය පවත්වාගැනීම අනෙක් මූලික පෘෂ්ඨවංශියන්ට සමානයි. මිනිස් එළඹි සිහිය නව නියෝකොටෙක්සයේ ඇති ඉහල හැකියාව නිසා ලද්දක් අතර සුෂුම්නා ශීර්ෂකයේ ඇති අතිශය ලෙස වර්ධනය වූ ව්‍යුහ නිසා සිදු වේ.

ප්‍රධාන ලක්‍ෂණ

තම ශරීරයට සාපේක්ෂව විශාලම මොළය පිහිටන්නේ මිනිසාට වන අතර එහි පරිමාව ඝන සෙ.මී. 1200 - 1500 දක්වා වෙනස් වේ. මස්තිෂ්ක අර්ධගෝල දෙකකින් හා අනුමස්තිෂ්කයකින් මොළයේ වැඩි කොටසක් සමන්විතවේ. මොළයේ උදරීය පසින් කපාලීය ස්නායු 12 ක් පැණ නගී. මොළය කායික වශයෙන් ශ්‍රම විභජනයක් දක්වයි. එනම් මොළයේ ඉහළ පෙදෙසින් සිරුරේ පහළ පෙදෙසත්, පහළ පෙදෙසින් සිරුරේ ඉහළ පෙදෙසත් මොළයේ වම් පෙදෙසින් සිරුරේ දකුණු පෙදෙසත් දකුණු පෙදෙසින් සිරුරේ වම් පෙදෙසත් පාලනය කෙරේ. මොළයේ හරස්කඩ මධ්‍යයේ ශ්වේත ද්‍රව්‍ය පෙදෙසක්ද පිටතින් ධූෂර ද්‍රව්‍ය පෙදෙසක්ද පිහිටන බව හඳුනා ගත හැක.

මිනිස් මොළය වටා ආරක්‍ෂිත ආවරණ තුනකි.

වරාශිකාව (බාහිර ආවරණය)
ජලාකාර පටලය (අතර මැද ආවරණය)
වීනාංශුකාව (අභ්‍යන්තර ආවරණය)

මස්තිෂ්කය

මිනිසාගේ මොළයේ විශාලම කොටස වනුයේ මස්තිෂ්කයයි.මෙය ගැඹුරු අන්වායාම පැල්මක් (මධ්‍ය අන්වායාම පරිකාව) මගින් වම් සහ දකුණු වශයෙන් අර්ධ ගෝල දෙකකට බෙදී ඇත.එක් එක් මස්තිෂ්ක අර්ධ ගෝලය ඛණ්ඩිකා හතරකට බෙදී ඇත.

ලලාට කණ්ඩිකාව.
පාර්ශවික කණ්ඩිකාව.
අපර කපාළ කණ්ඩිකාව.
ශංඛක ඛණ්ඩිකාව.
මස්තිෂ්ක අර්ධ ගෝල දෙක කැලෝස දේහය යනුවෙන් හඳුන්වන මොළයේ ගැඹුරින්ම පිහිටි ස්නායු තන්තු ගොනුවකින් එකිනෙකට සම්බන්ධව ඇත.මස්තිෂ්ක අර්ධ ගෝල තුළ මස්තිෂ්ක කෝෂිකාව බැගින් පිහිටා ඇත. මස්තිෂ්කයේ පර්යන්ත ප්‍රදේශය මස්තිෂ්ක බාහිකය නම් වෙයි.

මස්තිෂ්ක බාහිකය....

මස්තිෂ්ක බාහිකය අතිශයින් සංචලිතය. විවිධ ගැඹුරුවලින් යුත් ඇඟිලි රැසක් මස්තිෂ්ක බාහිකයේ මතුපිට පෘෂ්ඨයේ පිහිටයි.මස්තිෂ්ක බාහිකයේ ප්‍රධාන වශයෙන් ඇත්තේ නියුරෝන වල සෛල දේහ සහිත ධුසර ද්‍රව්‍යයයි.මස්තිෂ්ක බාහිකයට ඇතුළතින් මස්තිෂ්කය තුළමයිලිනීභූත ස්නායු තන්තු සහිත ශ්වේත ද්‍රව්‍ය පිහිටයි.මස්තිෂ්ක බාහිකයේ විවිධ ක්‍රියාවන් පාලනය කරන ප්‍රදේශ ඇත.එම ප්‍රදේශ ඛාණ්ඩ තුනකට බෙදේ.

සංවේදක ප්‍රදේශ.
චාලක ප්‍රදේශ.
සංගාමී ප්‍රදේශ.
මෙම ප්‍රදේශ සෛල-ආකාරවේදය(cytoarchitecture) අනුව තවත් කුඩා කොටස් රාශියකට බෙදෙන අතර මේවා බ්‍රෝඩ්මාන් ප්‍රදේශ නම්වේ.

සංවේදක ප්‍රදේශ ...

මොළයේ විවිධ අවයවයන්ට සංවේදි ප්‍රදේශ.
සංවේදක අවයව වලින් ආවේග ලැබෙනුයේ සංවේදක ප්‍රදේශ වලටයි.එනම්

දෟෂ්ටික සංවේදී ප්‍රදේශ
මේවා ඇත්තේ අපර කණ්ඩිකාවලය. ඇස්වල සිට ආවේග ලැබේ.
ශ්‍රවණ සංවේදී ප්‍රදේශ
මේවා ඇත්තේ ශංඛක කණ්ඩිකාවලය.ඇතුලු කනේ සිට ආවේග ලැබේ.
දෛහික සංවේදී ප්‍රදේශ
මේවා මස්තිෂ්කයේ පාර්ශව ඛණ්ඩිකාවේ පිහිටා ඇත.සමේ සහ පේශිවල ඇති ප්‍රතිග්‍රාහක සිට ආවේග ලැබේ.
චාලක ප්‍රදේශ
ඉච්චානුග පේෂිවලට ආවේග සැපයෙනුයේ චාලක ප්‍රදේශයේ සිටයි.එනම්,
දෛහික චාලක ප්‍රදේශය
මේවා ලලාට ඛණ්ඩිකාවේ මධ්‍ය පරිකාවට ඉදිරියෙන් පිහිටා ඇත.
කථන චාලක ප්‍රදේශය
මේවා ලලාට කණ්ඩිකාවේ පිහිටා ඇත.
දෛහික සංවේදක හා දෛහික චාලක ප්‍රදේශවල දේහයේ විවිධ අවයව සඳහා බලපාන විශේෂිත ප්‍රදේශ ඇත.සංවේදීතාව අධික අවයව සඳහා මෙම ප්‍රදේශවල ඉතා අධික ක්ෂේත්‍ර ඵලයක් වෙන් වී ඇත.අත්,දිව,ඇස්,කන්,තොල් ආදිය සඳහා මෙම ප්‍රදේශවල ඉතා අධික ක්ෂේත්‍රයක් වෙන් වී ඇති අතර කඳ,පාද,ආදිය සඳහා ඇත්තේ සාපේක්‍ෂ ලෙස අඩු ක්ෂේත්‍රඵලයකි.

සංගාමී ප්‍රදේශය

සංගාමී ප්‍රදේශ මඟින් කෙරෙනුයේ සංවේදක තොරතුරු නියමිත චාලක ප්‍රදේශයට යැවීමට පෙර තෝරා ගැනීම,සමාකලනය කිරීම සහ තැන්පත් කර ගැනීමයි.සංගාමී ප්‍රදේශය මතකය,ඉගෙනුම කෙරෙහි බලපායි.ඥානවන්ත බව හා පෞරුෂත්‍වය සඳහා වැදගත් වනුයේද මෙම සංගාමී ප්‍රදේශයයි. මස්තිෂ්කයේ වඩාත් ගැඹුරු ප්‍රදේවල ස්නායු සෛල දේහ සහිත ධුසර ද්‍රව්‍ය ගොනු කීපයක් ඇත.

1.පාදීය ගැංග්ලියම
2.තැලමස
3.හයිපොතැලමස
පාදීය ගැංග්ලියම
පාදීය ගැංග්ලියා යනු එක් එක් මස්තිෂ්ක අර්ධ ගෝලයේ පිහිටි ධුසර ද්‍රව්‍ය ගොනු කාණ්ඩ කිහිපයකි.

කාර්යය - සිරුරේ ඉච්චානුග පේශිවල චලනයන් සමායෝජනය කර දේහ ඉරියව් පාලනය කිරීම සිදු කරයි.

තැලමස

සම,අභ්‍යන්තර අවයව සහ ඇස,කන,දිව,නාසය ආදී සංවේදී අවයව ආදියේ සිට පැමිණෙන ආවේග මස්තිෂ්ක බාහිකයේ අදාළ සංවේදී ප්‍රදේශයට යාමට ප්‍රථම පැමිණෙනුයේ තැලමසටයි.

කාර්යය - සම,අන්තරංග අවයව,විශේෂ සංවේදී අවයව ආදියේ සිට පැමිණෙන ස්නායු ආවේග මස්තිෂ්ක බාහිකයේ පිහිටන නියමිත සංවේදක ප්‍රදේශ වෙතට යවන ආවේග සම්ප්‍රේෂණ මධ්‍යස්ථානය ලෙස ක්‍රියා කරයි.

හයිපොතැලමස

පුර්ව මස්තිෂ්කයේ පාදස්තයේ තැලමසට පහලින් හයිපොතැලමස පිහිටනු ලබයි.

මිනිස් මොළයේහි විවිධ ප්‍රදේශ.
කාර්යය -

පුර්ව පිටියුටරිය මත ක්‍රියා කරන හෝර්මෝන ස්‍රාවය කිරීම.
අපර පිටියුටරියේ ස්‍රාවය කරන හෝමෝන නිපදවීම.

දේහ උෂ්ණත්‍වය යාමනයට දායක වීම.
ස්නායු පද්ධතිය හා අන්තරාසර්ග පද්ධතිය අතර සම්බන්‍ධතාව ගොඩ නැගීම.
නිදා ගැනීම, අවදිවීම වැනි ක්‍රියාවන් පාලනය කිරීම.

කුසගින්න, පිපාසය වැනි හැඟීම් ඇති කිරීම.
පහරදීම, පලායාම වැනි ප්‍රතිචාර ඇති කිරීම.
රුධිර වාහිනීවල විශ්කම්භය,හෘදස්පන්දන වේගය වැනි ස්වයං සාධක ක්‍රියා පාලනය...

මිනිස් මොලය විසින් සිදු කරන, එහෙත් ඔබට හිතන්නවත් බැරි දේවල් ටිකක්...

මිනිස් මොළය පිළිබඳව ඔබ නොදත් බිහිසුණු තතු කිහිපයක් පහත වේ.මොළය යනු ශරීරයේ ඇති වැදගත්ම අවයවයයි.එබැවින් ඒ පිළිබඳව මනා දැනුමකින් යුතු වීම ඉතා අගනේය.

1. ඔබගේ ශරීරය තුල ඇති ස්නායු ඔවුන්වම ආහාරයට ගනී.

ශරීරයේ සම්පුර්ණ බරෙන් 2% මොළය සඳහා වෙන්වෙන බව ඔබ දන්නවද?ඒ වගේම ශරීරයට ලැබෙන සම්පුර්ණ ශක්තියෙන් 25%ක්ම ලබාගන්නේ මොළය විසිනි.මොලයේ ඇති බිලියන ප්‍රමාණයක් වූ ස්නායු සඳහා නියත ශක්ති ප්‍රදානයක් අවශ්‍ය අතර එලෙස ශක්තිය නියතව මොලයට නොලැබෙන විට ස්නායු විසින් තමන්වම ආහාරයට ගැනීමට පෙළඹෙයි.ඔබගේ බඩට බඩගිනි දැනෙනවා වගේම ස්නායු වලටද තදින්ම ශක්තිය අවශ්‍ය වේ.ආහාර වලින් ලැබෙන ශක්තිය පරිබෝජනය කිරීමට බලා සිටින ස්නායු වලට ආහාර නොගැනීම හේතුවෙන් ශක්තිය නොලැබෙන විට ඔවුන් තමන්ගේම කොටස් ආහාරයට ගැනීමට පෙලබෙයි.මෙම ක්‍රියාවලිය “කැණිබලිසම්” නමින් හඳුන්වන අතර ඔබව ආහාර ගැනීමට පොළඹවන ක්‍රියාවලියේ කොටසක් ලෙස මෙය දැක්විය හැකියි.අධික ලෙස ආහාර පාලනය කිරීම(ආහාර නොගෙන සිටීම)මගින් ඔබට නිරෝගී මොළයක් ලබාගැනීම සිහිනයක්ම වනු ඇත.

2.අවසානයක් නොමැති සිතුවිලි පාලනය නොකලොත් මොලය විසින් ඔබව සීමාවක් නොපෙනෙන ගැටළු ජාලාවක සිර කරනු ඇත.

දින කිහිපයක් පුරාවටම ඔබේ ඔලුවේ ගීතයක කොටසක් හෝ තාල මාලාවක කොටසක්,ඉතිරි කොටස මතක නැතුව සිර වී තිබෙනවාද? විද්‍යාඥයන් විසින් මෙම සංසිද්ධිය “ඉයර්වොර්ම්”ලෙස හඳුන්වන අතර ඔවුන් පවසන්නේ අපගේ මොලය සිතා අවසන් නොවුණු සිතුවිලි වලට අකමැති බවත් සැමවිටක පටන්ගත් කාර්යක් අවසන් වනතෙක් සිදු කිරීමට ඔබව පෙලඹන බවයි.අප සම්පුර්නයෙන්ම නොදන්නා ගීයක උවද දන්නා පද කිහිපවරක් අපට නොදැනුවත්වම නැවත නැවත කීමට අපව පොළඹවන්නේ මොළය විසිනි.එමගින් ගීතය අප විසින් සම්පුර්ණයෙන් අනුස්මරණය කරගනිමින් ගයනා කරනු ඇතැයි මොළය විශ්වාස කරයි.සම්පුර්ණ ලෙස නොදන්නා ගීත සොයාගෙන අසන්නට අප පෙළඹෙනුයේ මේ නිසාවෙනි. කිහිපවරක් එකම දෙය මුමුණන විට ,එකම දෙය ගැන සිතන විට එය ඔබට හුරු දෙයක් නැත්තම් සමීප දෙයක් බවට පත්වන්නේත් මොළයෙහි ක්‍රියාකාරිත්වය නිසාවෙනි.එසේ හුරු වීමෙන් පසුව එය සම්පුර්ණ ලෙස අවසන් කල සිතුවිල්ලක් ලෙස මනසට ඇතුල්වී මානසික තෘප්තිය කියන්නාවූ සංකල්පය සිත තුල ඇතිවේ.

3.වැඩි නින්ද ඔබගේ මොළයට හානි පමුණවයි 

නින්ද වැඩි බව මෙන්ම නින්ද අඩු වීම මොලයට අහිතකර බලපෑම් ඇතිකරන අතර අවදිවී සිටින කාලයට වඩා නින්දේදී මොළයෙහි ක්‍රියාකාරිත්වය වැඩිවේ.එබැවින් වැඩි වෙලා නිදා ගැනීමෙන් අනවශ්‍ය වෙහෙසවන මොළයෙහි ආයු කාලය අඩුවෙයි.එයින් කියවෙන්නේ ඔබ විසින් නින්ද අඩු කලයුතු බව නොවේ.දිනකට පැය 6ත් 8ත් අතර කාලයක් මිනිසෙකු විසින් නිදාගත යුතු අතර වැඩි වෙලා නිදාගැනීම නිසාවෙන් ඔබට අසමතුලිත,අසීරු බවක් දැනෙන්නේ මොළය අධික විඩාවෙන් සිටින නිසාවෙනි.මත්වූ විට හා අධික නින්දක් ලැබූ විට ඔබගේ තත්වය තෙරුන් ගැනීමට අපහසුවෙන් වික්ෂිප්ත වූ මනස විසින් ඔබව නින්දත් නොනින්දත් අතර තත්වයකට පත් කරයි.දිගින් දිගටම මෙලෙස සිදුවීම ඉතාමත් භයානක තත්වයක් වන අතර මානසික සහනයක් අවශ්‍ය නම් මත්ද්‍රව්‍ය භාවිතය මෙන්ම අධික ලෙස නිදා ගැනීමද ඔබ විසින් නතර කල යුතුයි.

4. ඔබේ ඇසින් දකින දේ සත්‍ය නොවේ.

ඔබේ ඇසින් දකිනා දේ සත්‍ය නොවේ.මෙසේ කියන විට ඔබේ සිතට අත්භූත හැඟීමක් දැනෙනවා නේද?දකින දේ ඇත්ත නොවේ නම් අප මේ දකින්නේ මොනවද?අපේ ඇසේ රෙටීනාව නැත්තම් දෘෂ්ටි විතානය මතට අප විසින් දකින දෙයක ආලෝකය ද්විමානව පතිත වන අතර මොළය විසින් අප දුටුව දේ නිවැරදිව වටහා ගෙන එය ත්‍රිමාණ රුවකට පරිවර්තනය කල යුතුයි.එබැවින් අප දකිනා දේ නිවැරදිම දේ නොවෙයි මොලය විසින් හඳුනාගන්නා දෙයයි. දෘෂ්ටිය යනු මිනිසාට දැනෙන බල සම්පන්නම සංවේදනය වන අතර මෙයද මොළය විසින් පාලනය කරනු ලබයි.එබැවින් දකින සැමදේම ඇත්ත නොවේ යන කියමන සත්‍යක් කරමින් අප මේ උත්සහ කරන්නේ මනස විසින් අපට රැවටිය හැකි බවයි.

5. වේදනාව යනු හුදෙක්ම මිථ්‍යාවකි

මොළයෙහි වේදනා ප්‍රතිග්‍රාහක නොමැත.වෛද්‍යවරුන් විසින් මොළයෙහි සැත්කම් සිදු කරන විට රෝගියාව සිහිමුර්ජා නොකරන්නේ මේ නිසාවෙනි.වේදනාව යනු හුදෙක්ම ජිවිතයේ ආරක්ෂාව සඳහා ප්‍රයෝජනය වීම පිණිස මොලය විසින් සිදු කරනාවූ සන්නිවේදනයකි.වේදනාවක් දැනුනේ නැත්තම් කිසිදු පැකිලීමකින් තොරව ජීවිතය අනතුරේ දමා කටයුතු කිරීමට අප පෙළඹෙනු නියතය.වේදනාව මොලය විසින් ශරීරයේ අනිකුත් සෑම අංගයක් වෙතම ලබාදුන්නත් මොලය මෙම බලවේගයෙන් ඈත්ව සිටියි.වේදනාව යනු මොළය විසින් ඇති කරන තත්වයක්ම පමණක් වන අතර සිත දියුණු කිරීම මගින් වේදනාව කියන කරුණ අපෙන් ඈත් කර ගැනීමට අපට හැකියාව ලැබෙනු ඇත.

6.මහත් සේ බියට පත්වූ විට කාම ආශාව දැඩිවේ 

ඔබ අතිශයින්ම බියට පත්වූ විටක මොලය විසින් “ඩොපමින්” යන ස්නායුසම්ප්‍රේෂකය මුදාහරින අතර එමගින් ඔබගේ කාමාශාව උද්දීපනය කෙරේ.ශරීරයේ ඩොපමින් ප්‍රමාණය ඉහල යන විට ගැහැණු පිරිමි දෙපාර්ශවේම ශරීරයේ ඇති ලිංගික ආශාව වර්ධනය කිරීම සඳහා ඉවහල් වන ටෙස්ටොස්ටෙරෝන් හොර්මනය ක්‍රියාත්මක වීම ආරම්භ වේ.ඔබ විසින් ඉතාම සංවේගී,හැඟීම්බර අවස්ථාවන්ට මුහුනදිමෙන්ද මොලය විසින් ඩොපමින් මුදා හැරීමට කටයුතු කීරිම
`

    })

}));

Nitross.addCommand({pattern: 'gk4 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/c8575f70abd6487c32259.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	ලෝකයේ කැපී පෙනෙන විප්ලව

👉කිසියක් ක්ෂේත්‍රයක් තුල කෙටි කාලයකදී ඇතිවන ප්‍රබල වෙනස්වීමක් විප්ලවයක් නම් වේ.

💕විප්ලව වලට උදාහරණ

💓ඇමෙරිකන් විප්ලවය
💓ප්‍රංශ විප්ලවය
💓රුසියන් විප්ල්වය


💕ඇමෙරිකන් විප්ලවය
❣️නායකයා- ජෝර්ජ් වොෂින්ටන්
❣️ආදර්ශ පාඨය
- නියෝජනයක් නැත්තම් බදුත් නැත.


💋වැදගත් අවස්තා
      
        👉බොස්ටන් තේ සාදය
        👉1774 පිලඩෙල්පියා සම්මේලනය
         👉ජනපදවල නියෝජිතයින් මහද්වීපික හමුදාවක් ලෙස සංවිදානය වී එම හමුදාවේ අණ දෙන නිළද්ධාරී තනතුරට ජෝර්ජ් වොෂින්ටන් පත් කිරීම.




💕ප්‍රංශ විප්ලවය

❣️වර්ෂය- 1789
❣️ආදර්ශ පාඨය- නිදහස,සමානාත්මතාව හා සහෝදරත්වය
❣️නායකයා- ලෆායෙට්

💋විශේෂ සිදුවීම්


      👉ප්‍රාදේශීය පාලනයට ඉන්ටේ ඩාන්ටේ වරු පත් කිරීම
      👉ටෙනිස් පිටියේ දිවුරුම
      👉1889.07.14 දින බැස්ටීල් බන්ධනාගාරයට පහර දීම.


💕රුසියන් විප්ලවය

❣️වර්ෂය- 1917
❣️ආදර්ශ පාඨය- සාමය,ඉඩම් හා ආහාර
❣️නායකයා- ලෙනින්

💋විශේෂ සිදුවීම්

            👉ගොවියන් හමුදාවට බදවා ගැනීම.
             👉ඇගලුම් කර්මාන්තශාලාවකින් මාර්තු විප්ලවය ඇරඹීම.
                                  👉බොල්ෂෙවික් හා මෙන්ෂෙවික් ලෙස පක්ෂ 2ක් ඒ වන විට බිහිව තිබීම.
`
    	})
}));

Nitross.addCommand({pattern: 'gk5 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/b6779e349578000333944.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`-------ලොව විශාලතම වැසි වනාන්තර 6ක්-------


වැසි වනාන්තර ලෝකයේ පැවැත්මට ඉතා විශාල දායකත්වයක් දක්වන පද්ධතීන්. විශාල වැසි වනාන්තර මඟින් ටොන් ගණනාවක කාබන් ඩයොක්සයිඩ් අවශෝෂණය කර ඔක්සිජන් වා තලයට මුදා හරිනවා. එමෙන්ම ඒවා තුළ ජල උල්පත් රාශියක් ආරක්ෂා වී තිබෙනවා. තව ද මේවා සත්ත්ව විශේෂයන් රාශියකට ජීවත් වන්නට නිවහනකුත්, රැකවරණයත් සලසනවා. මේ සටහන ලොව විශාලතම වැසි වනාන්තර අතුරින් ලොව වඩා කතාබහට ලක් වෙන 6ක් පිළිබඳව යි.


1. ඇමසන් වැසි වනාන්තරය

image.imagesunion.com
ඇමසන් වැසි වනාන්තරය ලොව විශාලතම වැසි වනාන්තරය යි. මෙය දකුණු ඇමෙරිකා මහාද්වීපයේ ඇමසන් ද්‍රෝණියේ වැඩි කොටසක් වසාගෙන පැතිරී තිබෙනවා. මෙහි භූමි වපසරිය අක්කර බිලියන 1.7කටත් වඩා අධික යි. මෙම වැසි වනාන්තරය බ්‍රසීලය, පීරු, කොලොම්බියා, වෙනසුවේලා, ඉක්වදෝරය, බොලිවියාව, ගයනාව, සුරිනාමය, හා ප්‍රංශ ගයනාව යන රටවල්වල කොටස් වසාගනිමින් පැතිරී තිබෙනවා. මෙම වනාන්තරයෙන් 60%ක් පවතින්නේ බ්‍රසීලය තුළ යි.

බ්‍රසීල ඇමසන් වනය සති 4ක පටන් තවමත් දැවෙමින් පවතිනවා. බ්‍රසීල ජනපතිගේ ක්‍රියාකලාපය මෙයට වගකිව යුතු බව ලොව වටා පරිසරවේදීන් සහ පරසර සංවිධානයන් චෝදනා කරනවා. 


2. කොංගෝ වැසි වනාන්තරය

worldpulse.com
කොංගෝ වැසි වනාන්තරය පිහිටා ඇත්තේ මධ්‍යම අප්‍රිකාවේ යි. මෙය ලොව දෙවන විශාලතම වැසි වනාන්තරය වෙනවා. කොංගෝ නදිය මෙය හරහා ගලා බසිනවා. මෙම වැසි වනාන්තරය උතුරු කොංගෝවේ සෑහෙන කොටසක් වසා පැතිරී ඇති අතර, නිතර සිදුවන දඩයම් කිරීම නිසා එහි ජීවත් වන සත්ත්ව ප්‍රජාව අනතුරට ලක් වී තිබෙනවා. ලොව ප්‍රකට පිග්මි චිම්පන්සීන් ගේ නිජබිම වන්නේ මේ කොංගෝ වනය යි. මෙහි භූමි වපසරිය අක්කර මිලියන 500ක් පමණ වෙනවා.


3. වැල්විඩියානු සෞම්‍ය කලාපික වැසි වනාන්තරය

intheviewfinder.com
මෙම වැසි වනාන්තරය ආජන්ටිනාවේ හා චිලී රාජ්‍යයේ අක්කර මිලියන 61ක පමණ භූමි වපසරියක් පුරා විහිදී පවතිනවා. ආවෘත බීජක ශාක, උණ, කේතුධර ගස්වලින් ප්‍රධානකොටම සැදුම්ලත් මෙහි සමහර ස්ථානවල අයිස් වැස්ම හා ග්ලැසියර පවා පිහිටා තිබෙනවා. අධික වර්ෂාව නිසා සාමාන්‍යයෙන් මෙහි පවතින්නේ වැඩි ආර්ද්‍රතාවයක්. මෙහි මීදුමෙන් බර දේශගුණයක් පවතිනවා.


4. ඩේන්ට්‍රී වැසි වනාන්තරය

theblondeabroad.com
මෙම ඝර්ම කලාපික වැසි වනාන්තරය පිහිටා තිබෙන්නේ ඕස්ට්‍රේලියාවේ, ක්වීන්ස්ලන්තයේ ඊසානදිගට වන්නට යි. මෙය අක්කර 650,000කට ආසන්න භූමි වපසරියක පැතිරී තිබෙනවා. මෙය මොස්මන් ශිඛරයෙන් හා බ්ලූම්ෆීල්ඩ් නදියෙන් මායිම්ව පිහිටා තිබෙනවා. මෙහි කොටසක ඩේන්ට්‍රී ජාතික උද්‍යානය පිහිටා තිබෙනවා. මෙහි ඉපැරණි ශාක වර්ග රාශියක් දැකගන්නට පුළුවන්.


5. ගිණිකොනදිග ආසියානු වැසි වනාන්තර

flawedthinkerthinks.blogspot.com
කාම්බෝජය ලාඕසය හා මලයා අර්ධද්වීපයට අයත් මැලේසියාව, මියන්මාරය හා තායිලන්තය පුරාවට පැතිරී තිබූ ගිණිකොනදිග ආසියානු වැසි වනාන්තර කලකට ප්‍රථම ඉතා විශාල භූමි වපසරියක පැතිරී තිබුණා. කෙසේ නමුත් අද වන විට වන විනාශය නිසා ඒවා සීග්‍රයෙන් වියැකී යමින් තිබෙනවා.

මෙම වනාන්තර දුර්ලභ පක්ෂී, ක්ෂීරපායී, උභයජීවී හා උරග විශේෂ රාශියකට සෙවන සලසනවා. වන විනාශය නිසා මෙම සත්ත්ව විශේෂයන් ද විශාල තර්ජනයකට මුහුණ පා තිබෙනවා. මෙය කලකට ඉහත ලොව ඉහළම ජෛව විවිධත්වයක් ඉසිළූ පෙදෙසක්. එකල මෙහි එක් හෙක්ටයාරයක් තුළ සාමාන්‍යයෙන් විශේෂ 200කට පමණ අයත් ශාකයන් තිබූ බවට තොරතුරු සඳහන්ව තිබෙනවා.


6. සිංහරාජ වැසි වනාන්තරය

allceylon.lk
අක්කර 18,900ක භූමි වපසරියක් වසාගෙන ශ්‍රී ලංකාවේ මධ්‍යම පෙදෙසෙන් නිරිතදිගට වන්නට පිහිටා ඇති සිංහරාජ වැසි වනාන්තරය ජාතික උද්‍යානයක් ලෙස ප්‍රකාශයට පත් කර තිබෙනවා. මීට අමතරව යුනෙස්කෝ සංවිධානය මඟින් 1978 වසරේ දී එය ජෛවගෝල රක්ෂිතයක් ලෙස ද ප්‍රකාශයට පත් කළා. මෙය ඒකදේශික සත්ත්ව විශේෂයන් රාශියකට සෙවන සපයනවා.

`
    	})
}));

Nitross.addCommand({pattern: 'gk6 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/0be70370e6e23b56c8d43.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`_✏️ ආහාර ජීර්ණ පද්ධතිය
       
      🔹  මුඛ කුහරයට ඇතුලු වන ආහාරය දත් මඟින් කුඩා කැබලි බවට ( යාන්ත්‍රික ජීරණය ) පත් කරයි. 
         
      🔹 මුඛ කුහරය තුළ ඇති ඛේට ඇමයිලේස් මඟින්,
     පිෂ්ටය ➡️ මෝල්ටෝස් බවට පත් කරයි. 
                          
       ▪️ආහාරය ග්‍රසනිකාවට ඇතුලූ වී අන්නස්‍රෝතය දිගේ ක්‍රමාකුංචනය මඟින් හෘදාසන්න වක්‍ර පිදාහය තුළින් ආමාශයට ඇතුලු වේ.
     
         🟢 ආමශයික යුෂය,
          
 1. HCl - පෙප්සීන් සක්‍රීය කරයි 

   2 . රෙනින් - කිරි කැටි ගැසීමට දායක වේ. (ළදරුවාගෙ) 

   3 . පෙප්සීන් - ප්‍රෝටීන් පොලිපෙප්ටයිඩ බවට පත් කරයි

        🔹 ආමාශයට ඇතුලූ ආහරය තලපයක් බවට පත් වේ. ( ආමලසය නම් වේ )
   ආමාශයේදි යාන්ත්‍රික ජීරණය සිදු වේ.
    
       ජලය, ග්ලූකෝස්, සමහර ඖෂධ ආමාශයේදි අවශෝෂණය වේ.  

   • පසුව ආමලසය c හැඩැති ග්‍රහණිය ඔස්සේ ක්ෂුද්‍රාන්තයට ඇතුලු වේ.
      
            ▪️ පිත් යුෂය  - පිත 
                                       පිත්ත වර්ණක
                                       පිත්ත ලවණ 
    ( මල ද්‍රව්‍යට කහ පාටට හේතුව පිත යි.) 
            ▪️ අග්න්‍යාශයික යුෂය 
                   🔸 ට්‍රිප්සීන් 
                   🔸 ඇමයිලේස්
                   🔸ලයිපේස් 
            
    ✨ පිත හා අග්න්‍යාශයික යුශය පිලිවෙලින් පිත්ත ප්‍රණාලය හා අග්න්‍යාශයික ප්‍රණාලයෙන් ග්‍රහණියට ඇතුලු වේ.

      පිත මඟින් ලිපිඩ 
                  👇🏻
 තෛලෝදකෘත ලිපිඩ බවට පත් කරයි. 
           
           _ °• ජීර්ණ අන්ථ ඵල •°_

  🌼  අග්න්‍යාශයේදී , 👇🏻
 
1. ට්‍රිප්සීන් - ප්‍රෝටීන් ➡️ පොලිපෙප්ටයිඩ 

2. ඇමයිලේස් - පිෂ්ටය ➡️ මෝල්ටෝස් 

3. ලයිපේස් - තෛලෝදකෘත ලිපිඩ ➡️ මේද අම්ල + ග්ලිසරෝල් 
( පයෝලස නාලිකාවට උරා ගනී. )
   
    🍀 ක්ෂුද්‍රාන්තයේදි 👇🏻

1. මෝල්ටේස් - මෝල්ටෝස් ➡️  ග්ලූකෝස් 

2. සුක්රේස් - සුක්‍රෝස් ➡️ ග්ලූකෝස් + ෆෘක්ටෝස්

3. ලැක්ටේස් - ලැක්ටෝස් ➡️ ග්ලූකෝස් + ගැලැක්ටෝස්
 
4. පෙප්ටිඩේස් - පොලිපෙප්ටයිඩ  ➡️ ඇමයිනො අම්ල

       🍂 අවසාන ජීරණය මහාන්ත්‍රයේදී සිදු වේ. අවසාන ලෙස ජලය අවශෝෂණය කර ගනීයි.
`
    	
    	})
}));

Nitross.addCommand({pattern: 'gk7 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/4765f5b503ef531e03f0c.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`•පොළොං තෙලිස්සා හෙවත් කුණකටුවා යනු නිශාචර භෞමික වාසී සර්ප විශේෂයකි. සිලින්ඩරාකාර ශරීරයක් දරන මේ සර්පයාගේ ගෙල පැහැදිලිව ගෙලෙන් වෙන් වී පවතී. ත්‍රිකෝණාකාර මහත හිසක් ඇත. පෘෂ්ඨයක් මතුපිට සිටින විට හිස අංශක 45කින් පමණ ඔසවාගෙන සිටී. කුඩා නාස් පුඩු දරන මේ සර්පයාට මදක් ඉදිරියට නෙරූ දුඹුරු පාට ඇස් පිහිටා ඇත. ශරීරයේ කලු පාට පැල්ලම් දැකිය හැක. 35 cm පමණ දිගකට වැඩෙන කුණකටුවා කුඩා සර්ප බිත්තර, කුඩා ක්ෂීරපායින්, සිකනලුන්, ගෙම්බන් ආහාරයට ගනී.
වැඩුනු ගැහැණු සතුන් මාර්තු ජුලි අතර කාලයේ පැටවු දැමීම සිදු කරයි. වරකට පැටවුන් 7ත් 14ත් අතර සංඛ්‍යාවක් උපත ලබන අතර උපතේදී මේ සර්පයින් 15 cm දිගකින් යුක්ත වේ.


#උපුටාගැනීමකි.`
    	
    	})
}));

Nitross.addCommand({pattern: 'gk8 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/2986572e44e841b36ee09.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`
----------නයගරා දිය ඇල්ල---------


නයගරාවේ පිහිටීම

නයගරාව උතුරු ඇමරිකාවේදී දැක ගැනීමට ලැබෙන සොඳුරු දසුනක් වනවා. එසේම නයගරා දිය ඇල්ල පිහිටා තිබෙන්නේ කැනඩාවත් ඇමරිකා එක්සත් ජනපදයත් වෙන් කරමින් එම රටවල් දෙක මධ්‍යයේ යි. කැනඩාවේ ඔන්ටේරියෝ නගරයද ඇමරිකාවේ නිව්යෝර්ක් නගරයද නයගරා ඇල්ලෙන් එම රටවල් දෙක වෙන් වෙන මායිමේ පිහිටි නගර ලෙස හඳුනාගත හැකියි.

එසේම මෙම දිය ඇල්ල ප්‍රධාන කොටස් දෙකක් වශයෙන් හඳුනාගත හැකියි. එහෙත් මෙය Horseshoe Falls, Bridal Veil Falls සහ American Falls යන දියඇලි තුනකින් සමන්විතය. එයින් විශාලම ප්‍රදේශය ලෙස එහි වම්පසට වන්නට පිහිටා තිබෙන කොටස හඳුනා ගත හැකි අතර එය කැනඩාවට අයිති වෙනවා. එය අශ්ව ලාඩමක හැඩය ඇති යයි සැලකෙන අතර එනිසා එය Horseshoe යන නමින් හඳුන්වනු ලබනවා. එය ආසන්න වශයෙන් උසින් අඩි 170වකුත් දිගින් අඩි 2500ක් පමණ වෙනවා. නයගරාවේ අනෙක් කොටස ඇමරිකාවේ නැගෙනහිරට වන්නට පිහිටා ඇති අතර එය ආසන්න වශයෙන් උසින් අඩි 180ක් පමණද දිගින් අඩි 1100ක් පමණද වෙනවා. මත්ස්‍ය වර්ග දිය ඇල්ල හරහා ගමන් කරන අතර ඉන් 90% ක් පමණ ජීවත් වේ. දියඇල්ලෙන් කඩා හැලෙන ජලයෙන් සුදු පැහැති පෙන බුබුළු නිසා ඔවුන්ගේ වැටීම අවහිර වන බව විශේෂඥයෝ පවසති.

නයගරා ඇල්ලට මෙම නම යෙදුන අන්දම සම්බන්ධයෙන් විවිධ අදහස් පවතිනවා. එහිදී 17 වන ශතවර්ෂයේදී මෙම ප්‍රදේශය niagagaregs යන නමින් හඳුන්වා ඇති අතර එනිසා නයගරා යනුවෙන් නම ලැබුණු බව එක් මතයක් වෙනවා. සමහර ගෝත්‍රිකයන් විසින් මෙම ප්‍රදේශය ongniaahra යන නමින් හැඳින්වූ නිසා එම නම ලැබුන බවද, එසේම ඊරි සහ ඔන්ටාරියේ යන විල් අතර වූ මෙම ප්‍රදේශය මිනිස් ගෙලකට සමාන වීම නිසා එයට එම නම ලැබුණු බවද කියවෙනවා.

මෙම දියඇල්ලෙන් ඇද හැලෙන ජලස්කන්ධය වර්තමානයේදී ජල විදුලිය නිපදවීම සඳහාද ප්‍රයෝජනයට ගනු ලබන අතර එමඟින් අත්වනුයේ ඉමහත් ප්‍රයෝජනයකි. සෑම පැයකදිම ජල ගැලුම් බිලියන 5.5 ක් මෙම දිය ඇල්ලෙන් ඇදහැලෙන අතර ඉන් 50%ක් ඇමෙරිකාවේ සහ කැනඩාවේ විදුලිය නිෂ්පාදනය සඳහා යොදාගනු ලබනවා. මිනිත්තුවකට ජල ගැලුම් 6000ක් නයගරා ඇල්ලෙන් කඩා හැලේ. ඇමෙරිකා එක්සත් ජනපදයේ ජල අවශ්‍යතාවයෙන් 20%ක් සපුරාලනු ලබන්නේ නයගරා දියඇල්ලයි. ක්‍රි.ව.1812න් පසුව මෙම ඇල්ල බොහෝ සෙයින් සංචාරකයන්ගේ ආකර්ෂණයට බඳුන් වී තිබෙනවා.


නයගරා ඇල්ල හා බැදුණු අතීත තොරතුරු.

නයගරා ඇල්ල හා බැදුණු අතීතය පිලිබඳව සලකා බලන විට එය වසර 12500 වඩා පැරණි අතීතයකට උරුමකම් කියයි. මුල්ම කාලයේ දී එනම් වසර 18 000කට පමණ පෙර මෙම ප්‍රදේශය කිලෝමීටර 2-3ක් පමණ ඝන අයිස් තට්ටුවකින් වැසී පැවත ඇති අතර කාලයත් සමග ග්ලැසියර දිය වී යාමෙන් මෙම දිය ඇල්ල නිර්මාණය වී තිබෙනවා. 1897 වසරේදී මෙම නයගරා ගංගාව හරහා ආරුක්කු පාලමක් නිර්මාණය කර ඇති අතර එය “whirlpool rapids bridge යන නමින් හඳුන්වනවා.

අද වනවිට මේ පාලම කැනඩාව හා ඇමරිකා එක්සත් ජනපදය අතර මෝටර් රථ, දුම්රිය සහ මගීන්ගේ ගමනාගමනයට විවෘත වෙනවා. එසේම ඇමරිකානු සිවිල් යුද්ධයෙන් පසුව නිව්යෝර්ක් දුම්රිය මාර්ගය සංචාරකයන් හා විවාපත් යුවතිපතින්ට විවෘත වුවා. එසේම මෙම නයගරා ඇල්ල අසල 1950දි ඉදිකරන ලද ඔරලෝසුවක්ද දැක ගැනීමට පිළිවන් වෙනවා.



නයගරා දියඇල්ලේ විශේෂතා.

මෙම දිය ඇල්ලෙහි විශේෂත්වය පිලිබඳව සලකා බලන විට එය රටවල් දෙකක් මෙන්ම ඊරි හා ඔන්ටාරියෝ යන විල්ද සම්බන්ධ කරනවා. නයගරා දියඇල්ල ප්‍රධාන ගංගා පහෙන් හතරක් හරහා ගලා එනු ලබයි. නයගරා දියඇල්ලෙන් නයගරා ගංගාව වෙතද පසුව ඔන්ටේරියෝ, ශාන්ත ලෝරන්ස්, හරහා අවසානයේදී අත්ලාන්තික් සාගරයට ජලය එකතු වෙයි. නයගරා දියඇල්ල ග්රසියරවල ප්‍රතිපලයක් වශයෙන් බිහි වන ලද්දක් වශයෙන්ද සැලකෙනවා. එසේම මෙය උසට වඩා දිගින් වැඩි දිය ඇල්ලක් වන අතර එනිසාම එහි සුන්දරත්වයද වැඩි කරනවා. සවස ඉර බැස යාමත් සමගම එය අලංකාර දසුනක් සංචාරකයන්ගේ නෙත් මානයට ගෙන එනවා. අධික මිදුම සුළඟ මෙන්ම අවට සිසාරා යන ජලබින්දු සහිත මේ පරිසරය චිත්තාකර්ෂණීය සිතුවිලි, පහල කරන ස්ථානයක් බව එය නරඹන ලද බොහෝ දෙනෙකුගේ අදහසයි.

 බොහෝ චිත්‍රපට ආදිය නිර්මාණය කිරීම සඳහා  මෙය යොදාගනු දකින්නට ලැබෙනවා. ‘Super Man’, මැරලින් මොන්රෝ රඟපෑ ‘Niagara’ චිත්‍රපට නයගරා දියඇල්ල අසලදී රූපගත කර තිබෙනවා.

මෙම දිය ඇල්ල තරණය කිරීම සදහා බොහෝ දෙනෙක් උත්සාහ දරා ඇති අතර එයින් බොහෝ දෙනෙක් මියගොස් තිබෙනවා. පසුගිය වසර 10 තුල දෙදෙනෙකු මියගොස් තිබෙනවා. එහෙත් මෙය තරණය කළ පළමු පුද්ගලයා ලෙස සැලකෙන්නේ වයස අවුරුදු 63ක් වූ කාන්තාවක් වන අතර ඒ 1901 වසරේදී යි. මෙම ඇල්ලේ යටි පාශානය වසරකට අඩි 4ක් පමණ බැගින් ඛාදනය වීමට ලක් වෙන අතර ඒ කඩා හැලෙන අධික ජලස්කන්ධය නිසාවෙනි. මේ ආකාරයට සොබාදහමේ සොඳුරු නිර්මාණයක් ලෙස මෙම නයගරා දිය ඇල්ල හදුනා ගැනීමට හැකි වන අතර එය ලෝක සම්පතක්ද වෙනවා.
`
    	})
}));

Nitross.addCommand({pattern: 'gk9 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/9d1d17a6525a3772a1f38.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `
         *කිංග් කෝබ්‍*රා


කිංග් කෝබ්‍රා යනු elapidae පවුලට අයත් අධික විෂ සහිත විශාල සර්ප විශේෂයකි. ඉන්දියාවේ වනාන්තර හා ඊසානදිග ආසියාවේ ප්‍රදේශ වලට ඒකදේශීය සත්ත්වයෙකි. මොවුන් ලොව වෙසෙන දිගම අධික විෂ සහිත සර්ප විශේෂයයි. වැඩුණු කෝබ්‍රාවන් මීටර් 3.18-4 දක්වා සාමාන්‍ය දිගකට ළඟා වේ. සොයාගෙන තිබෙන දිගම එකාගේ මිනුම මීටර් 5.85කි.

විද්‍යාත්මක නාමය  -  Ophiophagus hannah

සංරක්ෂණ තත්ත්වය  -  අනතුරට ලක්විය හැකි (අඩුවන ගහනය )

ස්කන්ධය  -  6kg

දිග  -     3.18-4m

පවුල  -  Elapidae

උසස් වර්ගීකරණය   -  Ophiophagus

රාජධානිය   -   Animalia

ගෝත්‍රය   -  Scaled reptiles


සාමාන්‍ය බර

කිලෝග්‍රෑම් 6ක්‌ පමණ.
කිංග් කෝබ්‍රාවුන් සාමාන්‍යයෙන් කිලෝග්‍රෑම් 6ක්‌ පමණ ස්කන්ධයකට ළඟාවේ.


 විලෝපිකයන්

කිංග් කෝබ්‍රාගේ ප්‍රධාන සතුරා වන්නේ මුගටියා ය. මක්නිසාද යත් මුගටියන්ට කෝබ්‍රාගේ විෂ බලපාන්නේ නැත. කෙසේවෙතත් කිංග් කෝබ්‍රා ද මුගටියන් සමග සටනට පැමිණියහොත් මිස මුගටියන් මොවුන් සමග සටනට යෑම දුර්ලභ ය.
කිංග් කෝබ්‍රාගේ විෂ දෂ්ටනයකට ලක්වූ මිනිසෙකු මිනිත්තු 45ක්‌ පමණ කාලයක් තුළදී මරණයට පත්වේ.


 අනුවර්තන

මොවුන්ගේ හැසිරීමේ එක අනුවර්තනයක් නම් මොවුන්ගේ දක්ෂතාව වන උඩපැනීමයි. මොවුන්ට මොවුන්ගේ ශරීරයේ දිගෙන් තුනෙන් එකක කොටසකට වන්නට උඩපැනීමට හැකිය. එනම් මොවුන්ට මිනිසා සමග ගත්විට මිනිසාගේ ඇස් වලට සමාන්තරව උඩපැන සිටිය හැක. එලෙස ඇස් වලට සමාන්තරව සිටිමින් සිදුකරන්නේ ඇස් වලට විෂ විදීමයි.

    	`
    	})
}));

Nitross.addCommand({pattern: 'gkr10 ?(.*)', fromMe: true, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/575e19e0278a18684c0cf.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`*👳🏾‍♀️මහාත්මා ගාන්ධි👳🏾‍♀️*

🫂මෝහන්දාස් කරම්චන්ද් ගාන්ධි යනු ඉන්දියානු නීතීඥයෙක්, යටත්විජිත විරෝධී ජාතිකවාදියෙක් සහ දේශපාලන සදාචාරයෙකි, ඔහු බ්‍රිතාන්‍ය පාලනයෙන් ඉන්දියාව නිදහස් කර ගැනීමේ ව්‍යාපාරය සාර්ථකව මෙහෙයවීමට අවිහිංසාවාදී ප්‍රතිරෝධයක් දැක්වීය. ඒ සමඟම ලොව පුරා සිවිල් අයිතිවාසිකම් සහ නිදහස සඳහා වූ ව්‍යාපාර දිරිගැන්වීය. 1914 දී දකුණු අප්‍රිකාවේදී ඔහුට මුලින්ම භාවිතා කරන ලද ගෞරවනීය මහත්මා දැන් ලොව පුරා භාවිතා වේ

🫂ගජරාටයේ වෙරළබඩ හින්දු පවුලක ඉපිද හැදී වැඩුණු ගාන්ධි ලන්ඩනයේ ඉනර් පන්සලේදී නීතිය පිළිබඳ පුහුණුව ලැබූ අතර 1891 ජුනි මාසයේදී වයස අවුරුදු 22 දී බාර්එක වෙත කැඳවනු ලැබීය. ඉන්දියාවේ අවිනිශ්චිත වසර දෙකකට පසු, ඔහුට සාර්ථක ආරම්භයක් ලබා ගැනීමට නොහැකි විය. නීති පුහුණුව, ඔහු 1893 දී දකුණු අප්‍රිකාවට ගොස් නඩුවකට ඉන්දියානු වෙළෙන්දෙකු නියෝජනය කළේය. ඔහු වසර 21 ක් දකුණු අප්‍රිකාවේ ජීවත් විය. දකුණු අප්‍රිකාවේදී ගාන්ධි පවුලක් ඇති දැඩි කළ අතර සිවිල් අයිතිවාසිකම් සඳහා වූ ව්‍යාපාරයකදී මුලින්ම අවිහිංසාවාදී ප්‍රතිරෝධයක් දැක්වීය. 1915 දී වයස අවුරුදු 45 දී ඔහු නැවත ඉන්දියාවට පැමිණියේය. අධික ඉඩම් බදු හා වෙනස් කොට සැලකීම් වලට එරෙහිව ගොවීන්, ගොවීන් සහ නාගරික කම්කරුවන් සංවිධානය කිරීමට ඔහු පියවර ගත්තේය. 1921 දී ඉන්දියානු ජාතික කොංග්‍රසයේ නායකත්වය භාර ගනිමින් ගාන්ධි දිළිඳුකම පිටුදැකීම, කාන්තා අයිතිවාසිකම් පුළුල් කිරීම, ආගමික හා ජනවාර්ගික සුහදතාව ගොඩනැගීම, නොපැහැදිලිභාවය අවසන් කිරීම සහ සියල්ලටම වඩා ස්වරාජ් හෝ ස්වයං පාලනය සාක්ෂාත් කර ගැනීම සඳහා රට පුරා උද්ඝෝෂණ මෙහෙයවීය.

🫂1921 දී ගාන්ධි ඉන්දියාවේ ග්‍රාමීය දුප්පතුන් හඳුනා ගැනීමේ ලකුණක් වශයෙන් සාම්ප්‍රදායික ඉන්දියානු කැරකෙන රෝදයක (චර්කා) නූල් වලින් අතින් වියන ලද ඉන්දියානු ලොම් රෙද්දක් (කෙටි දෝති) සහ සළුවක් (ශීත සෘතුවේදී) භාවිතා කිරීම භාර ගත්තේය. ඔහු ස්වයං පෝෂිත නේවාසික ප්‍රජාවක නිහතමානීව ජීවත් වීමට පටන් ගත් අතර සරල නිර්මාංශ ආහාර අනුභව කළ අතර ස්වයං පිරිසිදු කිරීමේ සහ දේශපාලන විරෝධය දැක්වීමේ මාධ්‍යයක් ලෙස දිගු උපවාසයන් කළේය. සාමාන්‍ය ඉන්දියානුවන් වෙත යටත්විජිත විරෝධී ජාතිකවාදය ගෙන ඒම සඳහා ගාන්ධි විසින් බ්‍රිතාන්‍යයන් විසින් පනවා තිබූ ලුණු බද්දට අභියෝග කරමින් කි.මී 400 (සැතපුම් 250) දණ්ඩී ලුණු මාර්තු 1930 දී සහ 1942 දී බ්‍රිතාන්‍යයින්ට ඉන්දියාවෙන් ඉවත් වන ලෙස ඉල්ලා සිටීම සඳහා නායකත්වය දුන්නේය. දකුණු අප්‍රිකාවේ මෙන්ම ඉන්දියාවේද වසර ගණනාවක් සහ වසර ගණනාවක් තිස්සේ.

🫂ආගමික බහුත්වවාදය මත පදනම් වූ ගාන්ධිගේ නිදහස් ඉන්දියාව පිළිබඳ දැක්ම 1940 ගණන් වල මුල් භාගයේදී අභියෝගයට ලක් වූයේ ඉන්දියාවෙන් කැටයම් කළ වෙනම මුස්ලිම් නිජබිමක් ඉල්ලා සිටි නව මුස්ලිම් ජාතිකවාදයක් මගිනි. 1947 අගෝස්තු මාසයේදී බ්‍රිතාන්‍යය නිදහස ලබා දුන් නමුත් බ්‍රිතාන්‍ය ඉන්දියානු අධිරාජ්‍යය හින්දු බහුතරයක් වූ ඉන්දියාව සහ මුස්ලිම් බහුතරයක් වූ පාකිස්තානය යන ආධිපත්‍ය දෙකකට බෙදුණි. බොහෝ අවතැන් වූ හින්දු, මුස්ලිම් සහ සික් ජාතිකයින් ඔවුන්ගේ නව ඉඩම් වූ ආගමික හිංසනය කරා ගමන් කළහ. විශේෂයෙන් පන්ජාබ් සහ බෙංගාලයේ පුපුරා ගියේය. දිල්ලියේ නිදහස නිල වශයෙන් සැමරීම අතහැර ගාන්ධි විපතට පත් ප්‍රදේශ වෙත ගොස් සැනසීම ලබා දීමට උත්සාහ කළේය. ඊළඟ මාස කිහිපය තුළ ඔහු ආගමික හිංසනය නැවැත්වීම සඳහා උපවාස කිහිපයක් ආරම්භ කළේය. 1948 ජනවාරි 12 දින ඔහුට 78 වැනි වියේදී සිදු කරන ලද මේවායින් අවසන් වරට පකිස්ථානයට ගෙවිය යුතු මුදල් වත්කම් කිහිපයක් ගෙවන ලෙසට ඉන්දියාවට බලපෑම් කිරීමේ වක්ර ඉලක්කය ද විය. සමහර ඉන්දියානුවන් සිතුවේ ගාන්ධි ඕනෑවට වඩා ඉඩ දෙන බවයි. ඔවුන් අතර 1948 ජනවාරි 30 දින ගාන්ධිගේ පපුවට වෙඩි උණ්ඩ තුනක් එල්ල කර ඝාතනය කළ හින්දු ජාතිකවාදියෙකු වූ නතුරාම් ගොඩ්සේ ද විය.

*🇮🇳ගාන්ධිගේ උපන් දිනය වන ඔක්තෝබර් 2 වන දින ඉන්දියාවේ ජාතික නිවාඩු දිනයක් වන ගාන්ධි ජයන්තිය ලෙසත් ලොව පුරා ජාත්‍යන්තර අවිහිංසාවාදී දිනය ලෙසත් සමරනු ලබයි. ගාන්ධි සාමාන්‍යයෙන් විධිමත් ලෙස නොවුනත් ඉන්දියාවේ ජාතියේ පියා ලෙස සැලකේ🇮🇳*

මුලාශ්‍රය - Wikipedia 

*#General Knowledge*`

    	})
}));

//public

Nitross.addCommand({ pattern: 'knowledge ?(.*)', fromMe: false, desc: gk}, (async (message, match) => {

	var respoimage = await axios.get(`https://telegra.ph/file/5929ee1dbf1109c562b04.jpg`, { responseType: 'arraybuffer' })

	await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 
		`╔════💢Nitross💢════╗
         ‖ GENARAL KNOWLEDGE ‖
          ═══════════════════


 💌1.command - gk1

      about - නයගරාව සුන්දර කරන මල් ඔරලෝසුව

 💌2.command - gk2

      about - සර්පයන්
      
 💌3.ommand - gk3

      about - අසිරිමත් මිනිස් මොළය...           

 💌4.command - gk4

      about - ලෝකයේ කැපී පෙනෙන විප්ලව

 💌5.command - gk5

      about - ලොව විශාලතම වැසි වනාන්තර 6ක්

 💌6.command - gk6

      about - ආහාර ජීර්ණ පද්ධතිය

 💌7.command - gk7

      about - කුණ කටුවා

 💌8.command - gk8

      about - නයගරා දිය ඇල්ල

 💌9.command - gk9

      about - කිංග් කෝබ්‍රා
      
 💌10.command - gkr10

      about - මහත් මා ගාන්ධි


💢තවත් බොහෝ විස්තර ළගදීම ඇතුලත් වේ.💢        
`
	})


    }));

Nitross.addCommand({pattern: 'gk1 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/7b8efabb1280e5560ab8c.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	-----නයගරාව සුන්දර කරන මල් ඔරලෝසුව-------
    	         ————————————————————————————


කැනඩාව සහ ඇමරිකා එක්සත් ජනපදය උතුරු ඇමරිකා මහද්වීපය තුළ පිහිටා තිබෙන විශාලතම රටවල් ද්විත්වය යි. එම රටවල් දෙක වෙන් වන දේශ සීමාවේ සුප්‍රකට නයගරා දිය ඇල්ල පිහිටා තිබෙනවා. ලොව දක්නට ලැබෙන සුන්දරම දිය ඇලි අතුරින් එකක් වන නයගරා ඇල්ල නැරඹීමට සංචාරකයන් විශාල වශයෙන් පැමිණෙනවා. එම සංචාරකයන් නයගරාවේ සුන්දරත්වය විඳගැනීමෙන් පසුව අනිවාර්යයෙන්ම නරඹන තවත් ස්ථානයක් තිබෙනවා. ඒ නයගරා උද්‍යානය තුළ පිහිටා තිබෙන අලංකාර මල් ඔරලෝසුව යි.


දිය ඇලි තුනක් එකතු වී සෑදුණු නයගරා ඇල්ල 

ඊරි විලේ සිට ඔන්ටේරියෝ විල දක්වා ජලය රැගෙන යන නයගරා ගංඟාවෙන් හෝර්ස්ෂූ, බ්‍රයිඩ්ල් වේල්, සහ ඇමරිකන් යන දිය ඇලි ත්‍රිත්වය නිර්මාණය වී තිබෙනවා. එම දිය ඇලි එකතු වීමෙන් සෑදී ඇති නයගරා දිය ඇල්ල උසින් මීටර් 51ක් සහ පළලින් මීටර් 1204ක් වන විට එහි ජල ඝනත්වය තත්පරයට මීටර් 2400ක් පමණ වනවා. මීට වසර 18000කට පමණ පෙර පැවති අයිස් යුගයේ දී මෙම ප්‍රදේශය ඝනකම් අයිස් තට්ටුවකින් වැසී තිබුණා. එම අයිස් තට්ටුව දියවීම හේතුවෙන් පංච මහා විල් සහ නයගරා ගඟ නිර්මාණය වුණා. ඉන් අනතුරුව නිර්මාණය වුණු නයගරා දිය ඇල්ල වසර 12000ක් පමණ පැරණි යි. රටවල් දෙකක් වෙන් කරන නයගරා දිය ඇල්ලට ආසන්නයෙන් පිහිටා තිබෙන ප්‍රධාන නගර වන්නේ ඔන්ටේරියෝ සහ නිව්යෝක් යන නගර දෙක යි.


මල් ඔරලෝසුව පිහිටා තිබෙන ස්ථානය 

නයගරා දිය ඇල්ලේ සිට ඔන්ටේරියෝ නගරය දෙසට කි. මී. 10ක් පමණ ගිය විට ඇඩම් බෙක් පළමු සහ දෙවන බලාගාර හමුවනවා. ඉන් ඇඩම් බෙක් පළමු බලාගාරය 1922 වසරේ දීත්, දෙවන බලාගාරය 1954 වසරේ දීත් ඉදිකර තිබෙනවා. ඊට අමතරව එම ප්‍රදේශය ආසන්නයේ ඔන්ටේරියෝ බලාගාරය පිහිටා තිබෙන ආකාරය දැකිය හැකියි. නව ඔන්ටේරියෝ බලාගාරය 1999 වසරේ දී ඉදිකර තිබුණත් ඊට පෙර එම ප්‍රදේශයේ පැරණි ඔන්ටේරියෝ බලාගාරයක් ක්‍රියාත්මක වුණා. 1906 වසරේ ආරම්භ කළ එම බලාගාරය 1999 වසරේ දී අක්‍රීය කරනු ලැබුවා. එම බලාගාර කිහිපය ආසන්නයේ ඉදිකර ඇති නයගරා උද්‍යානය තුළ සුප්‍රසිද්ධ නයගරා මල් ඔරලෝසුව නිර්මාණය කර තිබෙනවා.


මල් ඔරලෝසුවේ ඉතිහාසය

1940 දශකයේ අග භාගය වන විට ආචාර්ය රිචඩ් ලැන්කැස්ටර් හර්න් නම් ඉංජිනේරුවා පැරණි ඔන්ටේරියෝ බලාගාරයේ කළමනාකරු මෙන්ම ප්‍රධාන ඉංජිනේරුවරයා ලෙසින් කටයුතු කළා. පැරණි ඔන්ටේරියෝ බලාගාරය අසල පිහිටා තිබුණු සුන්දර නයගරා උද්‍යානය තුළ මල් ඔරලෝසුවක් ඉදිකිරීම පිළිබඳව මුලින්ම කල්පනා කළේ ලැන්කැස්ටර් ඉංජිනේරුවා යි. 1885 වසරේ දී ආරම්භ කළ නයගරා උද්‍යානය තුළ එවැනි මල් ඔරලෝසුවක් ඉදිකිරීමේ අදහස ඔහුට පහළ වුණේ එඩින්බරෝ මල් ඔරලෝසුව දැකීමෙන් පසුව යි. 1903 වසරේ දී ස්කොට්ලන්තයේ එඩින්බරෝ නුවර ඉදි කළ එය ලොව පැරණිම මල් ඔරලෝසුව බවට පත් වුණා. 

එඩින්බරෝ මල් ඔරලෝසුව අධ්‍යයනය කළ රිචඩ් ලැන්කැස්ටර් ඊට වඩා විශාල ඔරලෝසුවක් නයගරා උද්‍යානයේ ඉදිකරනු ලැබුවා. 1950 වසරේ දී වැඩ නිමා කළ එම මල් ඔරලෝසුව අයත් වුණේ පැරණි ඔන්ටේරියෝ බලාගාරයට යි. එම නිසා ඔරලෝසුවේ මුහුණතේ ඉලක්කම් 12 වෙනුවට ONTARIO HYDRO යන අකුරු 12 සටහන් කර තිබුණා. නමුත් 1977 වසරේ දී නයගරා උද්‍යානයට ඔරලෝසුවේ නඩත්තු කටයුතු භාරදීමත් සමගම එහි NIAGARA PARKS යනුවෙන් සටහන් කරනු ලැබුවා. එම නිසා වර්තමානය වන විට මල් ඔරලෝසු මුහුණතේ සටහන් කර තිබෙන්නේ NIAGARA PARKS යන අකුරු 12යි.


ඔරලෝසුව පිළිබඳව තවදුරටත්

එඩින්බරෝ මල් ඔරලෝසුවේ විෂ්කම්භය අඩි 10ක් වන විට මෙම මල් ඔරලෝසුවේ විෂ්කම්භය අඩි 40ක් පමණ වනවා. නයගරා මල් ඔරලෝසුවේ අඩි 38ක් පමණ පළලින් යුත් භූමි ප්‍රදේශයක් පුරා විවිධ මල් වර්ග දක්නට ලැබෙනවා. එසේම ඔරලෝසුව වටා තිබෙන ජල උද්‍යානය එහි අලංකාරය තවත් වැඩිකර තිබෙනවා. නයගරා මල් ඔරලෝසු මුහුණත තුළ සුදුසු ආකාරයට මල් වර්ග වැවීම කරනු ලබන්නේ නයගරා උද්‍යානයේ සිටින උද්භිද විද්‍යාඥයන්ගේ අධීක්ෂණය යටතේ යි. සාමාන්‍යයෙන් මෙම ඔරලෝසුවට යොදාගන්නා මල් පැළවල ස්වරූපය වසරකට දෙවරක් වෙනස් කරයි. ඒ අනුව සිසිර සමයේ අළු පාටින් පැහැයෙන් දිස්වන මල් ඔරලෝසුව වසන්තයේ දී හරිත පැහැයෙන් දිස්වන්නේ වියෝලා මල් නිසා යි. දළ වශයෙන් මල් පැළ 24000 කින් පමණ සමන්විත මෙම ඔරලෝසුව වඩාත් අලංකාර වන්නේ එහි සිටුවා ඇති සියළුම පැළවල මල් හටගැනීමෙන් පසුව යි.  


භාවිතා කර තිබෙන තාක්ෂණය

මෙම ඔරලෝසු මුහුණත තුළ දක්නට ලැබෙන පැය කටුව අඩි 14.5ක දිගකින් යුක්ත වන විට මිනිත්තු කටුව අඩි 17.5ක දිගකට සාදා තිබෙනවා. ඊට අමතරව මෙහි මුහුණතේ දක්නට ලැබෙන තත්පර කටුව අඩි 21ක පමණ දිගකට නිර්මාණය කර තිබෙන ආකාරය නිරීක්ෂණය කළ හැකියි. එසේම මෙම ඔරලෝසුවේ කටු තුනෙහි බර රාත්තල් 1250ක් පමණ වනවා. ශබ්දවාහීනී යන්ත්‍රයක් මඟින් සෑම විනාඩි 15කට වරක්ම මෙහි ඔරලෝසු නාදය විසුරුවා හරිනවා. එම කාර්යය සඳහා අශ්වබල 5කින් යුත් යන්ත්‍රයක් භාවිතා කරනවා. මෙහි ඔරලෝසු යාන්ත්‍රණය තෙල්වල ධාවනය වන අතර එය 2 hp-three-phase squirrel cage මෝටරයක් මඟින් මෙහෙයවනු ලබනවා. නමුත් දැන් එය 1500 RPM synchronous මෝටරයකින් ක්‍රියා කළ හැකි ආකාරයට සකස් කර තිබෙනවා. නයගරා මල් ඔරලෝසුව නිර්මාණය කළ අවධියේ එහි සියළුම තාක්ෂණික කටයුතු සිදුකරනු ලැබුවේ පැරණි ඔන්ටේරියෝ බලාගාරයේ කාර්යය මණ්ඩලයයි.

දැනට වසර 43ක සිට නයගරා මල් ඔරලෝසුව නඩත්තු කරන්නේ නයගරා උද්‍යානයේ කාර්යය මණ්ඩලය යි. මෙම මල් ඔරලෝසුවේ මුල් අයිතිකරුවන් වුණු පැරණි ඔන්ටේරියෝ බලාගාරය අද එහි දක්නට නැහැ. එසේම මෙය නිර්මාණය කළ ඉංජිනේරුවරයා වුණු  රිචඩ් ලැන්කැස්ටර් ද අද ජීවතුන් අතර නැහැ. නයගරා මල් ඔරලෝසුව සෑදීමට දායක වුණු සියළුදෙනාම අද ජීවතුන් අතර නොසිටියත් ඔවුන් කළ විශිෂ්ට නිර්මාණය තව දිගු කලක් යන තුරු නොනැසී පවතිනු ඇති.
`})

    }));

Nitross.addCommand({pattern: 'gk2 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var r_text = new Array ();
    
    
    r_text[0] = "https://telegra.ph/file/14f1d4a9cd8cdc075f144.jpg";
    r_text[1] = "https://telegra.ph/file/1ec8362bbd05ccd78c88a.jpg";
    r_text[2] = "https://telegra.ph/file/1caf3461d2a192345baf4.jpg";
    r_text[3] = "https://telegra.ph/file/000a4cdecca0d792d5c82.jpg";

    var i = Math.floor(5*Math.random())

    var respoimage = await axios.get(`${r_text[i]}`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	සර්පයන් දිගටි, අසරණ, මාංශ භක්ෂක උරගයින් වන උප සර්පයින් / සර්පන්ටිස් /. අනෙක් සියලුම චතුරස්රයන් මෙන් සර්පයන් අස්ථි, ඇම්නියොට් පෘෂ් b වංශීන් අතිච්ඡාදනය වන පරිමාණයන්ගෙන් ආවරණය වී ඇත. බොහෝ සර්ප විශේෂවල කටුස්සන්ගේ මුතුන් මිත්තන්ට වඩා සන්ධි කිහිපයක් ඇති අතර ඔවුන්ගේ හිසට වඩා විශාල ගොදුරක් ඔවුන්ගේ ජංගම හකු වලින් ගිල දැමීමට හැකි වේ. ඔවුන්ගේ පටු සිරුරු නවාතැන් ගැනීම සඳහා සර්පයන්ගේ යුගල අවයව (වකුගඩු වැනි) එක පැත්තකින් නොව එකින් එක ඉදිරියෙන් දිස්වන අතර බොහෝ දෙනෙකුට ඇත්තේ එක් ක්‍රියාකාරී පෙනහළු පමණි. සමහර විශේෂයන් සළුවෙහි දෙපැත්තේම නියපොතු යුගලයක් සහිත ශ්‍රෝණි ඉඟ පටියක් රඳවා ගනී. කටුස්සන්ගේ අත් පා නොමැතිව දිගටි සිරුරු පරිණාමය වී ඇති අතර අවයව පරිණාමය හරහා ස්වාධීනව විසිපස් ගුණයක් පමණ අවයවයන් අඩු වී ඇත. මේවා සර්පයන්ට සමාන ය, නමුත් කකුල් නැති කටුස්සන්ගේ පොදු කණ්ඩායම් කිහිපයකට ඇසිපිය හා බාහිර කන් ඇති අතර, සර්පයන් නොමැති නමුත් මෙම නියමය විශ්වීය නොවේ.
ජීවමාන සර්පයන් ඇන්ටාක්ටිකාව හැර සෑම මහද්වීපයකම දක්නට ලැබේ. ව්‍යතිරේකයන් අතර අයර්ලන්තය, අයිස්ලන්තය, ග්‍රීන්ලන්තය, හවායි දූපත් සමූහය සහ නවසීලන්ත දූපත් මෙන්ම අත්ලාන්තික් හා මධ්‍යම පැසිෆික් සාගරයේ කුඩා දූපත් ද ඇතුළත් වේ. මීට අමතරව, ඉන්දියානු සහ පැසිෆික් සාගර පුරා මුහුදු සර්පයන් බහුලව දක්නට ලැබේ. පවුල් 20 කට වැඩි ප්‍රමාණයක් සහ විශේෂ 3,900 කින් සමන්විත පවුල් විස්සකට වැඩි ප්‍රමාණයක් දැනට හඳුනාගෙන ඇත. සෙන්ටිමීටර 10.4 ක් දිග (අඟල් 4.1) බාබඩෝස් නූල් [6] සිට මීටර් 6.95 (අඩි 22.8) ක දිගකින් යුත් පයිතන් දක්වා ඒවා විශාල වේ. [7] ටයිටනොබෝවා සෙරෙජොනෙන්සිස් නම් පොසිල විශේෂයේ දිග මීටර් 12.8 (අඩි 42) කි. සර්පයන් පරිණාමය වී ඇත්තේ බුරාසිං හෝ ජලජ කටුස්සන්ගෙන් විය හැක, සමහර විට ජුරාසික් යුගයේදී, පැරණිතම පැරණිතම ෆොසිල 143 ත් 167 ත් අතර කාලයට අයත් වේ. [9] [10] නූතන සර්පයන්ගේ විවිධත්වය පැලියොසීන් යුගයේ දී දක්නට ලැබුණි (ක්‍රි.පූ. 66 සිට 56 Ma ට පෙර, ක්‍රිටේසියස්-පැලියෝජීන් වඳවීමේ සිදුවීමෙන් පසුව). සර්පයන් පිළිබඳ පැරණිතම විස්තර කර ඇත්තේ බෘක්ලින් පැපිරස්හි ය.

සර්ප විශේෂ බොහොමයක් අනාරක්ෂිත වන අතර විෂ ඇති අය එය මූලික වශයෙන් භාවිතා කරන්නේ ආත්මාරක්ෂාව සඳහා නොව ගොදුර මරා දැමීමට සහ යටත් කර ගැනීමට ය. සමහරුන්ට මිනිසුන්ට වේදනාකාරී තුවාල හෝ මරණයක් සිදු කිරීමට තරම් විෂ සහිත විෂ ඇත. අවිධිමත් සර්පයන් ගොදුරු පණපිටින් ගිල දමයි
`})

    }));

Nitross.addCommand({pattern: 'gk3 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/eda74c45628561c497561.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	අසිරිමත් මිනිස් මොළය...
         =====================

මිනිස් මොළය ස්නායු පද්ධතිය තුළ වැදගත් අවයවයක් වන අතර ඉතා සංකීර්ණතාවකින් යුතු අවයවයකි.

මිනිස් මොළය මධ්‍ය ස්නායු පද්ධතිය (කපාල හා සුසුම්නාව අඩංගු) පර්යන්ත ස්නායු පද්ධතිය ස්නායු පද්ධතිය පාලනය කරන අතර සෑම ක්‍රියාකරීත්වයක්ම පාලනය කෙරේ. අනිච්ඡානුග හෝ අඩු මට්ටමේ ක්‍රියාවන් (හෘද ස්පන්දන වේගය, ශ්වසනය, ආහාර ජීර්ණය, ඉච්ඡානුග පාලනයකින් තොරව මොළයෙන් සිදුවේ. විශේෂයෙන්ම ස්වයං සාධක ස්නායු පද්ධතිය මඟිනි. සංකීර්ණ හා උසස් මානසික ක්‍රියා (සිතීම, හේතු දැක්වීම, තේරුම් ගැනීම ආදී ඉච්ඡානුගව පාලනය වේ. කාය විවච්ඡේද විද්‍යාව අනුව කොටස් 3ක පෙර මොළය, මැද මොළය, පසු මොළය. පෙර මොළයෙහි නම් වූ මස්තිෂ්ක චලිතයෙහි ඛණ්ඩිකා කිහිපයක් ඇති අතර උසස් කෘත්‍යයන් පාලනය කරයි. මැද හා පසු මොළය අනිච්ඡානුග කෘත්‍යයන් සිදු කරයි. කපාලකරණයේ දී අනෙක් විශේෂවලට වඩා මිනිස් මොළය ශරීරයට සාපේක්ෂව ඉහළයි. පූර්ව මස්තිශ්කයේදී මෙම සිද්ධිය ප්‍රකටව දැක්වේ. පූර්ව මස්තිශ්කය භාෂාව හා සිහිය පිළිබඳ සොයා බැලේ. මෙය මානව මොළයෙන් 76% පමණ කොටසකින් යුතුයි. අනෙක් සත්වයන්ට වඩා විශාල වූ නියෝකොටෙක් නිසා මානවයන්ටම විශේෂිත වූ මානසික හැකියාවන් (ආදී විශේෂවලට සමාන වූ ස්නායු වාස්තු විද්‍යාවක් තිබුණ ද) සෑදීමට හැකියාව ඇත. උත්තේජවලට ප්‍රතිචාර දැක්වීමට මානවයන්ගේ ඇති පද්ධති, පාරිසරික සංවේදන, සමස්ථිතිය පවත්වාගැනීම අනෙක් මූලික පෘෂ්ඨවංශියන්ට සමානයි. මිනිස් එළඹි සිහිය නව නියෝකොටෙක්සයේ ඇති ඉහල හැකියාව නිසා ලද්දක් අතර සුෂුම්නා ශීර්ෂකයේ ඇති අතිශය ලෙස වර්ධනය වූ ව්‍යුහ නිසා සිදු වේ.

ප්‍රධාන ලක්‍ෂණ

තම ශරීරයට සාපේක්ෂව විශාලම මොළය පිහිටන්නේ මිනිසාට වන අතර එහි පරිමාව ඝන සෙ.මී. 1200 - 1500 දක්වා වෙනස් වේ. මස්තිෂ්ක අර්ධගෝල දෙකකින් හා අනුමස්තිෂ්කයකින් මොළයේ වැඩි කොටසක් සමන්විතවේ. මොළයේ උදරීය පසින් කපාලීය ස්නායු 12 ක් පැණ නගී. මොළය කායික වශයෙන් ශ්‍රම විභජනයක් දක්වයි. එනම් මොළයේ ඉහළ පෙදෙසින් සිරුරේ පහළ පෙදෙසත්, පහළ පෙදෙසින් සිරුරේ ඉහළ පෙදෙසත් මොළයේ වම් පෙදෙසින් සිරුරේ දකුණු පෙදෙසත් දකුණු පෙදෙසින් සිරුරේ වම් පෙදෙසත් පාලනය කෙරේ. මොළයේ හරස්කඩ මධ්‍යයේ ශ්වේත ද්‍රව්‍ය පෙදෙසක්ද පිටතින් ධූෂර ද්‍රව්‍ය පෙදෙසක්ද පිහිටන බව හඳුනා ගත හැක.

මිනිස් මොළය වටා ආරක්‍ෂිත ආවරණ තුනකි.

වරාශිකාව (බාහිර ආවරණය)
ජලාකාර පටලය (අතර මැද ආවරණය)
වීනාංශුකාව (අභ්‍යන්තර ආවරණය)

මස්තිෂ්කය

මිනිසාගේ මොළයේ විශාලම කොටස වනුයේ මස්තිෂ්කයයි.මෙය ගැඹුරු අන්වායාම පැල්මක් (මධ්‍ය අන්වායාම පරිකාව) මගින් වම් සහ දකුණු වශයෙන් අර්ධ ගෝල දෙකකට බෙදී ඇත.එක් එක් මස්තිෂ්ක අර්ධ ගෝලය ඛණ්ඩිකා හතරකට බෙදී ඇත.

ලලාට කණ්ඩිකාව.
පාර්ශවික කණ්ඩිකාව.
අපර කපාළ කණ්ඩිකාව.
ශංඛක ඛණ්ඩිකාව.
මස්තිෂ්ක අර්ධ ගෝල දෙක කැලෝස දේහය යනුවෙන් හඳුන්වන මොළයේ ගැඹුරින්ම පිහිටි ස්නායු තන්තු ගොනුවකින් එකිනෙකට සම්බන්ධව ඇත.මස්තිෂ්ක අර්ධ ගෝල තුළ මස්තිෂ්ක කෝෂිකාව බැගින් පිහිටා ඇත. මස්තිෂ්කයේ පර්යන්ත ප්‍රදේශය මස්තිෂ්ක බාහිකය නම් වෙයි.

මස්තිෂ්ක බාහිකය....

මස්තිෂ්ක බාහිකය අතිශයින් සංචලිතය. විවිධ ගැඹුරුවලින් යුත් ඇඟිලි රැසක් මස්තිෂ්ක බාහිකයේ මතුපිට පෘෂ්ඨයේ පිහිටයි.මස්තිෂ්ක බාහිකයේ ප්‍රධාන වශයෙන් ඇත්තේ නියුරෝන වල සෛල දේහ සහිත ධුසර ද්‍රව්‍යයයි.මස්තිෂ්ක බාහිකයට ඇතුළතින් මස්තිෂ්කය තුළමයිලිනීභූත ස්නායු තන්තු සහිත ශ්වේත ද්‍රව්‍ය පිහිටයි.මස්තිෂ්ක බාහිකයේ විවිධ ක්‍රියාවන් පාලනය කරන ප්‍රදේශ ඇත.එම ප්‍රදේශ ඛාණ්ඩ තුනකට බෙදේ.

සංවේදක ප්‍රදේශ.
චාලක ප්‍රදේශ.
සංගාමී ප්‍රදේශ.
මෙම ප්‍රදේශ සෛල-ආකාරවේදය(cytoarchitecture) අනුව තවත් කුඩා කොටස් රාශියකට බෙදෙන අතර මේවා බ්‍රෝඩ්මාන් ප්‍රදේශ නම්වේ.

සංවේදක ප්‍රදේශ ...

මොළයේ විවිධ අවයවයන්ට සංවේදි ප්‍රදේශ.
සංවේදක අවයව වලින් ආවේග ලැබෙනුයේ සංවේදක ප්‍රදේශ වලටයි.එනම්

දෟෂ්ටික සංවේදී ප්‍රදේශ
මේවා ඇත්තේ අපර කණ්ඩිකාවලය. ඇස්වල සිට ආවේග ලැබේ.
ශ්‍රවණ සංවේදී ප්‍රදේශ
මේවා ඇත්තේ ශංඛක කණ්ඩිකාවලය.ඇතුලු කනේ සිට ආවේග ලැබේ.
දෛහික සංවේදී ප්‍රදේශ
මේවා මස්තිෂ්කයේ පාර්ශව ඛණ්ඩිකාවේ පිහිටා ඇත.සමේ සහ පේශිවල ඇති ප්‍රතිග්‍රාහක සිට ආවේග ලැබේ.
චාලක ප්‍රදේශ
ඉච්චානුග පේෂිවලට ආවේග සැපයෙනුයේ චාලක ප්‍රදේශයේ සිටයි.එනම්,
දෛහික චාලක ප්‍රදේශය
මේවා ලලාට ඛණ්ඩිකාවේ මධ්‍ය පරිකාවට ඉදිරියෙන් පිහිටා ඇත.
කථන චාලක ප්‍රදේශය
මේවා ලලාට කණ්ඩිකාවේ පිහිටා ඇත.
දෛහික සංවේදක හා දෛහික චාලක ප්‍රදේශවල දේහයේ විවිධ අවයව සඳහා බලපාන විශේෂිත ප්‍රදේශ ඇත.සංවේදීතාව අධික අවයව සඳහා මෙම ප්‍රදේශවල ඉතා අධික ක්ෂේත්‍ර ඵලයක් වෙන් වී ඇත.අත්,දිව,ඇස්,කන්,තොල් ආදිය සඳහා මෙම ප්‍රදේශවල ඉතා අධික ක්ෂේත්‍රයක් වෙන් වී ඇති අතර කඳ,පාද,ආදිය සඳහා ඇත්තේ සාපේක්‍ෂ ලෙස අඩු ක්ෂේත්‍රඵලයකි.

සංගාමී ප්‍රදේශය

සංගාමී ප්‍රදේශ මඟින් කෙරෙනුයේ සංවේදක තොරතුරු නියමිත චාලක ප්‍රදේශයට යැවීමට පෙර තෝරා ගැනීම,සමාකලනය කිරීම සහ තැන්පත් කර ගැනීමයි.සංගාමී ප්‍රදේශය මතකය,ඉගෙනුම කෙරෙහි බලපායි.ඥානවන්ත බව හා පෞරුෂත්‍වය සඳහා වැදගත් වනුයේද මෙම සංගාමී ප්‍රදේශයයි. මස්තිෂ්කයේ වඩාත් ගැඹුරු ප්‍රදේවල ස්නායු සෛල දේහ සහිත ධුසර ද්‍රව්‍ය ගොනු කීපයක් ඇත.

1.පාදීය ගැංග්ලියම
2.තැලමස
3.හයිපොතැලමස
පාදීය ගැංග්ලියම
පාදීය ගැංග්ලියා යනු එක් එක් මස්තිෂ්ක අර්ධ ගෝලයේ පිහිටි ධුසර ද්‍රව්‍ය ගොනු කාණ්ඩ කිහිපයකි.

කාර්යය - සිරුරේ ඉච්චානුග පේශිවල චලනයන් සමායෝජනය කර දේහ ඉරියව් පාලනය කිරීම සිදු කරයි.

තැලමස

සම,අභ්‍යන්තර අවයව සහ ඇස,කන,දිව,නාසය ආදී සංවේදී අවයව ආදියේ සිට පැමිණෙන ආවේග මස්තිෂ්ක බාහිකයේ අදාළ සංවේදී ප්‍රදේශයට යාමට ප්‍රථම පැමිණෙනුයේ තැලමසටයි.

කාර්යය - සම,අන්තරංග අවයව,විශේෂ සංවේදී අවයව ආදියේ සිට පැමිණෙන ස්නායු ආවේග මස්තිෂ්ක බාහිකයේ පිහිටන නියමිත සංවේදක ප්‍රදේශ වෙතට යවන ආවේග සම්ප්‍රේෂණ මධ්‍යස්ථානය ලෙස ක්‍රියා කරයි.

හයිපොතැලමස

පුර්ව මස්තිෂ්කයේ පාදස්තයේ තැලමසට පහලින් හයිපොතැලමස පිහිටනු ලබයි.

මිනිස් මොළයේහි විවිධ ප්‍රදේශ.
කාර්යය -

පුර්ව පිටියුටරිය මත ක්‍රියා කරන හෝර්මෝන ස්‍රාවය කිරීම.
අපර පිටියුටරියේ ස්‍රාවය කරන හෝමෝන නිපදවීම.

දේහ උෂ්ණත්‍වය යාමනයට දායක වීම.
ස්නායු පද්ධතිය හා අන්තරාසර්ග පද්ධතිය අතර සම්බන්‍ධතාව ගොඩ නැගීම.
නිදා ගැනීම, අවදිවීම වැනි ක්‍රියාවන් පාලනය කිරීම.

කුසගින්න, පිපාසය වැනි හැඟීම් ඇති කිරීම.
පහරදීම, පලායාම වැනි ප්‍රතිචාර ඇති කිරීම.
රුධිර වාහිනීවල විශ්කම්භය,හෘදස්පන්දන වේගය වැනි ස්වයං සාධක ක්‍රියා පාලනය...

මිනිස් මොලය විසින් සිදු කරන, එහෙත් ඔබට හිතන්නවත් බැරි දේවල් ටිකක්...

මිනිස් මොළය පිළිබඳව ඔබ නොදත් බිහිසුණු තතු කිහිපයක් පහත වේ.මොළය යනු ශරීරයේ ඇති වැදගත්ම අවයවයයි.එබැවින් ඒ පිළිබඳව මනා දැනුමකින් යුතු වීම ඉතා අගනේය.

1. ඔබගේ ශරීරය තුල ඇති ස්නායු ඔවුන්වම ආහාරයට ගනී.

ශරීරයේ සම්පුර්ණ බරෙන් 2% මොළය සඳහා වෙන්වෙන බව ඔබ දන්නවද?ඒ වගේම ශරීරයට ලැබෙන සම්පුර්ණ ශක්තියෙන් 25%ක්ම ලබාගන්නේ මොළය විසිනි.මොලයේ ඇති බිලියන ප්‍රමාණයක් වූ ස්නායු සඳහා නියත ශක්ති ප්‍රදානයක් අවශ්‍ය අතර එලෙස ශක්තිය නියතව මොලයට නොලැබෙන විට ස්නායු විසින් තමන්වම ආහාරයට ගැනීමට පෙළඹෙයි.ඔබගේ බඩට බඩගිනි දැනෙනවා වගේම ස්නායු වලටද තදින්ම ශක්තිය අවශ්‍ය වේ.ආහාර වලින් ලැබෙන ශක්තිය පරිබෝජනය කිරීමට බලා සිටින ස්නායු වලට ආහාර නොගැනීම හේතුවෙන් ශක්තිය නොලැබෙන විට ඔවුන් තමන්ගේම කොටස් ආහාරයට ගැනීමට පෙලබෙයි.මෙම ක්‍රියාවලිය “කැණිබලිසම්” නමින් හඳුන්වන අතර ඔබව ආහාර ගැනීමට පොළඹවන ක්‍රියාවලියේ කොටසක් ලෙස මෙය දැක්විය හැකියි.අධික ලෙස ආහාර පාලනය කිරීම(ආහාර නොගෙන සිටීම)මගින් ඔබට නිරෝගී මොළයක් ලබාගැනීම සිහිනයක්ම වනු ඇත.

2.අවසානයක් නොමැති සිතුවිලි පාලනය නොකලොත් මොලය විසින් ඔබව සීමාවක් නොපෙනෙන ගැටළු ජාලාවක සිර කරනු ඇත.

දින කිහිපයක් පුරාවටම ඔබේ ඔලුවේ ගීතයක කොටසක් හෝ තාල මාලාවක කොටසක්,ඉතිරි කොටස මතක නැතුව සිර වී තිබෙනවාද? විද්‍යාඥයන් විසින් මෙම සංසිද්ධිය “ඉයර්වොර්ම්”ලෙස හඳුන්වන අතර ඔවුන් පවසන්නේ අපගේ මොලය සිතා අවසන් නොවුණු සිතුවිලි වලට අකමැති බවත් සැමවිටක පටන්ගත් කාර්යක් අවසන් වනතෙක් සිදු කිරීමට ඔබව පෙලඹන බවයි.අප සම්පුර්නයෙන්ම නොදන්නා ගීයක උවද දන්නා පද කිහිපවරක් අපට නොදැනුවත්වම නැවත නැවත කීමට අපව පොළඹවන්නේ මොළය විසිනි.එමගින් ගීතය අප විසින් සම්පුර්ණයෙන් අනුස්මරණය කරගනිමින් ගයනා කරනු ඇතැයි මොළය විශ්වාස කරයි.සම්පුර්ණ ලෙස නොදන්නා ගීත සොයාගෙන අසන්නට අප පෙළඹෙනුයේ මේ නිසාවෙනි. කිහිපවරක් එකම දෙය මුමුණන විට ,එකම දෙය ගැන සිතන විට එය ඔබට හුරු දෙයක් නැත්තම් සමීප දෙයක් බවට පත්වන්නේත් මොළයෙහි ක්‍රියාකාරිත්වය නිසාවෙනි.එසේ හුරු වීමෙන් පසුව එය සම්පුර්ණ ලෙස අවසන් කල සිතුවිල්ලක් ලෙස මනසට ඇතුල්වී මානසික තෘප්තිය කියන්නාවූ සංකල්පය සිත තුල ඇතිවේ.

3.වැඩි නින්ද ඔබගේ මොළයට හානි පමුණවයි 

නින්ද වැඩි බව මෙන්ම නින්ද අඩු වීම මොලයට අහිතකර බලපෑම් ඇතිකරන අතර අවදිවී සිටින කාලයට වඩා නින්දේදී මොළයෙහි ක්‍රියාකාරිත්වය වැඩිවේ.එබැවින් වැඩි වෙලා නිදා ගැනීමෙන් අනවශ්‍ය වෙහෙසවන මොළයෙහි ආයු කාලය අඩුවෙයි.එයින් කියවෙන්නේ ඔබ විසින් නින්ද අඩු කලයුතු බව නොවේ.දිනකට පැය 6ත් 8ත් අතර කාලයක් මිනිසෙකු විසින් නිදාගත යුතු අතර වැඩි වෙලා නිදාගැනීම නිසාවෙන් ඔබට අසමතුලිත,අසීරු බවක් දැනෙන්නේ මොළය අධික විඩාවෙන් සිටින නිසාවෙනි.මත්වූ විට හා අධික නින්දක් ලැබූ විට ඔබගේ තත්වය තෙරුන් ගැනීමට අපහසුවෙන් වික්ෂිප්ත වූ මනස විසින් ඔබව නින්දත් නොනින්දත් අතර තත්වයකට පත් කරයි.දිගින් දිගටම මෙලෙස සිදුවීම ඉතාමත් භයානක තත්වයක් වන අතර මානසික සහනයක් අවශ්‍ය නම් මත්ද්‍රව්‍ය භාවිතය මෙන්ම අධික ලෙස නිදා ගැනීමද ඔබ විසින් නතර කල යුතුයි.

4. ඔබේ ඇසින් දකින දේ සත්‍ය නොවේ.

ඔබේ ඇසින් දකිනා දේ සත්‍ය නොවේ.මෙසේ කියන විට ඔබේ සිතට අත්භූත හැඟීමක් දැනෙනවා නේද?දකින දේ ඇත්ත නොවේ නම් අප මේ දකින්නේ මොනවද?අපේ ඇසේ රෙටීනාව නැත්තම් දෘෂ්ටි විතානය මතට අප විසින් දකින දෙයක ආලෝකය ද්විමානව පතිත වන අතර මොළය විසින් අප දුටුව දේ නිවැරදිව වටහා ගෙන එය ත්‍රිමාණ රුවකට පරිවර්තනය කල යුතුයි.එබැවින් අප දකිනා දේ නිවැරදිම දේ නොවෙයි මොලය විසින් හඳුනාගන්නා දෙයයි. දෘෂ්ටිය යනු මිනිසාට දැනෙන බල සම්පන්නම සංවේදනය වන අතර මෙයද මොළය විසින් පාලනය කරනු ලබයි.එබැවින් දකින සැමදේම ඇත්ත නොවේ යන කියමන සත්‍යක් කරමින් අප මේ උත්සහ කරන්නේ මනස විසින් අපට රැවටිය හැකි බවයි.

5. වේදනාව යනු හුදෙක්ම මිථ්‍යාවකි

මොළයෙහි වේදනා ප්‍රතිග්‍රාහක නොමැත.වෛද්‍යවරුන් විසින් මොළයෙහි සැත්කම් සිදු කරන විට රෝගියාව සිහිමුර්ජා නොකරන්නේ මේ නිසාවෙනි.වේදනාව යනු හුදෙක්ම ජිවිතයේ ආරක්ෂාව සඳහා ප්‍රයෝජනය වීම පිණිස මොලය විසින් සිදු කරනාවූ සන්නිවේදනයකි.වේදනාවක් දැනුනේ නැත්තම් කිසිදු පැකිලීමකින් තොරව ජීවිතය අනතුරේ දමා කටයුතු කිරීමට අප පෙළඹෙනු නියතය.වේදනාව මොලය විසින් ශරීරයේ අනිකුත් සෑම අංගයක් වෙතම ලබාදුන්නත් මොලය මෙම බලවේගයෙන් ඈත්ව සිටියි.වේදනාව යනු මොළය විසින් ඇති කරන තත්වයක්ම පමණක් වන අතර සිත දියුණු කිරීම මගින් වේදනාව කියන කරුණ අපෙන් ඈත් කර ගැනීමට අපට හැකියාව ලැබෙනු ඇත.

6.මහත් සේ බියට පත්වූ විට කාම ආශාව දැඩිවේ 

ඔබ අතිශයින්ම බියට පත්වූ විටක මොලය විසින් “ඩොපමින්” යන ස්නායුසම්ප්‍රේෂකය මුදාහරින අතර එමගින් ඔබගේ කාමාශාව උද්දීපනය කෙරේ.ශරීරයේ ඩොපමින් ප්‍රමාණය ඉහල යන විට ගැහැණු පිරිමි දෙපාර්ශවේම ශරීරයේ ඇති ලිංගික ආශාව වර්ධනය කිරීම සඳහා ඉවහල් වන ටෙස්ටොස්ටෙරෝන් හොර්මනය ක්‍රියාත්මක වීම ආරම්භ වේ.ඔබ විසින් ඉතාම සංවේගී,හැඟීම්බර අවස්ථාවන්ට මුහුනදිමෙන්ද මොලය විසින් ඩොපමින් මුදා හැරීමට කටයුතු කීරිම
`

    })

}));

Nitross.addCommand({pattern: 'gk4 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/c8575f70abd6487c32259.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `

    	ලෝකයේ කැපී පෙනෙන විප්ලව

👉කිසියක් ක්ෂේත්‍රයක් තුල කෙටි කාලයකදී ඇතිවන ප්‍රබල වෙනස්වීමක් විප්ලවයක් නම් වේ.

💕විප්ලව වලට උදාහරණ

💓ඇමෙරිකන් විප්ලවය
💓ප්‍රංශ විප්ලවය
💓රුසියන් විප්ල්වය


💕ඇමෙරිකන් විප්ලවය
❣️නායකයා- ජෝර්ජ් වොෂින්ටන්
❣️ආදර්ශ පාඨය
- නියෝජනයක් නැත්තම් බදුත් නැත.


💋වැදගත් අවස්තා
      
        👉බොස්ටන් තේ සාදය
        👉1774 පිලඩෙල්පියා සම්මේලනය
         👉ජනපදවල නියෝජිතයින් මහද්වීපික හමුදාවක් ලෙස සංවිදානය වී එම හමුදාවේ අණ දෙන නිළද්ධාරී තනතුරට ජෝර්ජ් වොෂින්ටන් පත් කිරීම.




💕ප්‍රංශ විප්ලවය

❣️වර්ෂය- 1789
❣️ආදර්ශ පාඨය- නිදහස,සමානාත්මතාව හා සහෝදරත්වය
❣️නායකයා- ලෆායෙට්

💋විශේෂ සිදුවීම්


      👉ප්‍රාදේශීය පාලනයට ඉන්ටේ ඩාන්ටේ වරු පත් කිරීම
      👉ටෙනිස් පිටියේ දිවුරුම
      👉1889.07.14 දින බැස්ටීල් බන්ධනාගාරයට පහර දීම.


💕රුසියන් විප්ලවය

❣️වර්ෂය- 1917
❣️ආදර්ශ පාඨය- සාමය,ඉඩම් හා ආහාර
❣️නායකයා- ලෙනින්

💋විශේෂ සිදුවීම්

            👉ගොවියන් හමුදාවට බදවා ගැනීම.
             👉ඇගලුම් කර්මාන්තශාලාවකින් මාර්තු විප්ලවය ඇරඹීම.
                                  👉බොල්ෂෙවික් හා මෙන්ෂෙවික් ලෙස පක්ෂ 2ක් ඒ වන විට බිහිව තිබීම.
`
    	})
}));

Nitross.addCommand({pattern: 'gk5 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/b6779e349578000333944.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`-------ලොව විශාලතම වැසි වනාන්තර 6ක්-------


වැසි වනාන්තර ලෝකයේ පැවැත්මට ඉතා විශාල දායකත්වයක් දක්වන පද්ධතීන්. විශාල වැසි වනාන්තර මඟින් ටොන් ගණනාවක කාබන් ඩයොක්සයිඩ් අවශෝෂණය කර ඔක්සිජන් වා තලයට මුදා හරිනවා. එමෙන්ම ඒවා තුළ ජල උල්පත් රාශියක් ආරක්ෂා වී තිබෙනවා. තව ද මේවා සත්ත්ව විශේෂයන් රාශියකට ජීවත් වන්නට නිවහනකුත්, රැකවරණයත් සලසනවා. මේ සටහන ලොව විශාලතම වැසි වනාන්තර අතුරින් ලොව වඩා කතාබහට ලක් වෙන 6ක් පිළිබඳව යි.


1. ඇමසන් වැසි වනාන්තරය

image.imagesunion.com
ඇමසන් වැසි වනාන්තරය ලොව විශාලතම වැසි වනාන්තරය යි. මෙය දකුණු ඇමෙරිකා මහාද්වීපයේ ඇමසන් ද්‍රෝණියේ වැඩි කොටසක් වසාගෙන පැතිරී තිබෙනවා. මෙහි භූමි වපසරිය අක්කර බිලියන 1.7කටත් වඩා අධික යි. මෙම වැසි වනාන්තරය බ්‍රසීලය, පීරු, කොලොම්බියා, වෙනසුවේලා, ඉක්වදෝරය, බොලිවියාව, ගයනාව, සුරිනාමය, හා ප්‍රංශ ගයනාව යන රටවල්වල කොටස් වසාගනිමින් පැතිරී තිබෙනවා. මෙම වනාන්තරයෙන් 60%ක් පවතින්නේ බ්‍රසීලය තුළ යි.

බ්‍රසීල ඇමසන් වනය සති 4ක පටන් තවමත් දැවෙමින් පවතිනවා. බ්‍රසීල ජනපතිගේ ක්‍රියාකලාපය මෙයට වගකිව යුතු බව ලොව වටා පරිසරවේදීන් සහ පරසර සංවිධානයන් චෝදනා කරනවා. 


2. කොංගෝ වැසි වනාන්තරය

worldpulse.com
කොංගෝ වැසි වනාන්තරය පිහිටා ඇත්තේ මධ්‍යම අප්‍රිකාවේ යි. මෙය ලොව දෙවන විශාලතම වැසි වනාන්තරය වෙනවා. කොංගෝ නදිය මෙය හරහා ගලා බසිනවා. මෙම වැසි වනාන්තරය උතුරු කොංගෝවේ සෑහෙන කොටසක් වසා පැතිරී ඇති අතර, නිතර සිදුවන දඩයම් කිරීම නිසා එහි ජීවත් වන සත්ත්ව ප්‍රජාව අනතුරට ලක් වී තිබෙනවා. ලොව ප්‍රකට පිග්මි චිම්පන්සීන් ගේ නිජබිම වන්නේ මේ කොංගෝ වනය යි. මෙහි භූමි වපසරිය අක්කර මිලියන 500ක් පමණ වෙනවා.


3. වැල්විඩියානු සෞම්‍ය කලාපික වැසි වනාන්තරය

intheviewfinder.com
මෙම වැසි වනාන්තරය ආජන්ටිනාවේ හා චිලී රාජ්‍යයේ අක්කර මිලියන 61ක පමණ භූමි වපසරියක් පුරා විහිදී පවතිනවා. ආවෘත බීජක ශාක, උණ, කේතුධර ගස්වලින් ප්‍රධානකොටම සැදුම්ලත් මෙහි සමහර ස්ථානවල අයිස් වැස්ම හා ග්ලැසියර පවා පිහිටා තිබෙනවා. අධික වර්ෂාව නිසා සාමාන්‍යයෙන් මෙහි පවතින්නේ වැඩි ආර්ද්‍රතාවයක්. මෙහි මීදුමෙන් බර දේශගුණයක් පවතිනවා.


4. ඩේන්ට්‍රී වැසි වනාන්තරය

theblondeabroad.com
මෙම ඝර්ම කලාපික වැසි වනාන්තරය පිහිටා තිබෙන්නේ ඕස්ට්‍රේලියාවේ, ක්වීන්ස්ලන්තයේ ඊසානදිගට වන්නට යි. මෙය අක්කර 650,000කට ආසන්න භූමි වපසරියක පැතිරී තිබෙනවා. මෙය මොස්මන් ශිඛරයෙන් හා බ්ලූම්ෆීල්ඩ් නදියෙන් මායිම්ව පිහිටා තිබෙනවා. මෙහි කොටසක ඩේන්ට්‍රී ජාතික උද්‍යානය පිහිටා තිබෙනවා. මෙහි ඉපැරණි ශාක වර්ග රාශියක් දැකගන්නට පුළුවන්.


5. ගිණිකොනදිග ආසියානු වැසි වනාන්තර

flawedthinkerthinks.blogspot.com
කාම්බෝජය ලාඕසය හා මලයා අර්ධද්වීපයට අයත් මැලේසියාව, මියන්මාරය හා තායිලන්තය පුරාවට පැතිරී තිබූ ගිණිකොනදිග ආසියානු වැසි වනාන්තර කලකට ප්‍රථම ඉතා විශාල භූමි වපසරියක පැතිරී තිබුණා. කෙසේ නමුත් අද වන විට වන විනාශය නිසා ඒවා සීග්‍රයෙන් වියැකී යමින් තිබෙනවා.

මෙම වනාන්තර දුර්ලභ පක්ෂී, ක්ෂීරපායී, උභයජීවී හා උරග විශේෂ රාශියකට සෙවන සලසනවා. වන විනාශය නිසා මෙම සත්ත්ව විශේෂයන් ද විශාල තර්ජනයකට මුහුණ පා තිබෙනවා. මෙය කලකට ඉහත ලොව ඉහළම ජෛව විවිධත්වයක් ඉසිළූ පෙදෙසක්. එකල මෙහි එක් හෙක්ටයාරයක් තුළ සාමාන්‍යයෙන් විශේෂ 200කට පමණ අයත් ශාකයන් තිබූ බවට තොරතුරු සඳහන්ව තිබෙනවා.


6. සිංහරාජ වැසි වනාන්තරය

allceylon.lk
අක්කර 18,900ක භූමි වපසරියක් වසාගෙන ශ්‍රී ලංකාවේ මධ්‍යම පෙදෙසෙන් නිරිතදිගට වන්නට පිහිටා ඇති සිංහරාජ වැසි වනාන්තරය ජාතික උද්‍යානයක් ලෙස ප්‍රකාශයට පත් කර තිබෙනවා. මීට අමතරව යුනෙස්කෝ සංවිධානය මඟින් 1978 වසරේ දී එය ජෛවගෝල රක්ෂිතයක් ලෙස ද ප්‍රකාශයට පත් කළා. මෙය ඒකදේශික සත්ත්ව විශේෂයන් රාශියකට සෙවන සපයනවා.

`
    	})
}));

Nitross.addCommand({pattern: 'gk6 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/0be70370e6e23b56c8d43.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`_✏️ ආහාර ජීර්ණ පද්ධතිය
       
      🔹  මුඛ කුහරයට ඇතුලු වන ආහාරය දත් මඟින් කුඩා කැබලි බවට ( යාන්ත්‍රික ජීරණය ) පත් කරයි. 
         
      🔹 මුඛ කුහරය තුළ ඇති ඛේට ඇමයිලේස් මඟින්,
     පිෂ්ටය ➡️ මෝල්ටෝස් බවට පත් කරයි. 
                          
       ▪️ආහාරය ග්‍රසනිකාවට ඇතුලූ වී අන්නස්‍රෝතය දිගේ ක්‍රමාකුංචනය මඟින් හෘදාසන්න වක්‍ර පිදාහය තුළින් ආමාශයට ඇතුලු වේ.
     
         🟢 ආමශයික යුෂය,
          
 1. HCl - පෙප්සීන් සක්‍රීය කරයි 

   2 . රෙනින් - කිරි කැටි ගැසීමට දායක වේ. (ළදරුවාගෙ) 

   3 . පෙප්සීන් - ප්‍රෝටීන් පොලිපෙප්ටයිඩ බවට පත් කරයි

        🔹 ආමාශයට ඇතුලූ ආහරය තලපයක් බවට පත් වේ. ( ආමලසය නම් වේ )
   ආමාශයේදි යාන්ත්‍රික ජීරණය සිදු වේ.
    
       ජලය, ග්ලූකෝස්, සමහර ඖෂධ ආමාශයේදි අවශෝෂණය වේ.  

   • පසුව ආමලසය c හැඩැති ග්‍රහණිය ඔස්සේ ක්ෂුද්‍රාන්තයට ඇතුලු වේ.
      
            ▪️ පිත් යුෂය  - පිත 
                                       පිත්ත වර්ණක
                                       පිත්ත ලවණ 
    ( මල ද්‍රව්‍යට කහ පාටට හේතුව පිත යි.) 
            ▪️ අග්න්‍යාශයික යුෂය 
                   🔸 ට්‍රිප්සීන් 
                   🔸 ඇමයිලේස්
                   🔸ලයිපේස් 
            
    ✨ පිත හා අග්න්‍යාශයික යුශය පිලිවෙලින් පිත්ත ප්‍රණාලය හා අග්න්‍යාශයික ප්‍රණාලයෙන් ග්‍රහණියට ඇතුලු වේ.

      පිත මඟින් ලිපිඩ 
                  👇🏻
 තෛලෝදකෘත ලිපිඩ බවට පත් කරයි. 
           
           _ °• ජීර්ණ අන්ථ ඵල •°_

  🌼  අග්න්‍යාශයේදී , 👇🏻
 
1. ට්‍රිප්සීන් - ප්‍රෝටීන් ➡️ පොලිපෙප්ටයිඩ 

2. ඇමයිලේස් - පිෂ්ටය ➡️ මෝල්ටෝස් 

3. ලයිපේස් - තෛලෝදකෘත ලිපිඩ ➡️ මේද අම්ල + ග්ලිසරෝල් 
( පයෝලස නාලිකාවට උරා ගනී. )
   
    🍀 ක්ෂුද්‍රාන්තයේදි 👇🏻

1. මෝල්ටේස් - මෝල්ටෝස් ➡️  ග්ලූකෝස් 

2. සුක්රේස් - සුක්‍රෝස් ➡️ ග්ලූකෝස් + ෆෘක්ටෝස්

3. ලැක්ටේස් - ලැක්ටෝස් ➡️ ග්ලූකෝස් + ගැලැක්ටෝස්
 
4. පෙප්ටිඩේස් - පොලිපෙප්ටයිඩ  ➡️ ඇමයිනො අම්ල

       🍂 අවසාන ජීරණය මහාන්ත්‍රයේදී සිදු වේ. අවසාන ලෙස ජලය අවශෝෂණය කර ගනීයි.
`
    	
    	})
}));

Nitross.addCommand({pattern: 'gk7 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/4765f5b503ef531e03f0c.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`•පොළොං තෙලිස්සා හෙවත් කුණකටුවා යනු නිශාචර භෞමික වාසී සර්ප විශේෂයකි. සිලින්ඩරාකාර ශරීරයක් දරන මේ සර්පයාගේ ගෙල පැහැදිලිව ගෙලෙන් වෙන් වී පවතී. ත්‍රිකෝණාකාර මහත හිසක් ඇත. පෘෂ්ඨයක් මතුපිට සිටින විට හිස අංශක 45කින් පමණ ඔසවාගෙන සිටී. කුඩා නාස් පුඩු දරන මේ සර්පයාට මදක් ඉදිරියට නෙරූ දුඹුරු පාට ඇස් පිහිටා ඇත. ශරීරයේ කලු පාට පැල්ලම් දැකිය හැක. 35 cm පමණ දිගකට වැඩෙන කුණකටුවා කුඩා සර්ප බිත්තර, කුඩා ක්ෂීරපායින්, සිකනලුන්, ගෙම්බන් ආහාරයට ගනී.
වැඩුනු ගැහැණු සතුන් මාර්තු ජුලි අතර කාලයේ පැටවු දැමීම සිදු කරයි. වරකට පැටවුන් 7ත් 14ත් අතර සංඛ්‍යාවක් උපත ලබන අතර උපතේදී මේ සර්පයින් 15 cm දිගකින් යුක්ත වේ.


#උපුටාගැනීමකි.`
    	
    	})
}));

Nitross.addCommand({pattern: 'gk8 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/2986572e44e841b36ee09.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`
----------නයගරා දිය ඇල්ල---------


නයගරාවේ පිහිටීම

නයගරාව උතුරු ඇමරිකාවේදී දැක ගැනීමට ලැබෙන සොඳුරු දසුනක් වනවා. එසේම නයගරා දිය ඇල්ල පිහිටා තිබෙන්නේ කැනඩාවත් ඇමරිකා එක්සත් ජනපදයත් වෙන් කරමින් එම රටවල් දෙක මධ්‍යයේ යි. කැනඩාවේ ඔන්ටේරියෝ නගරයද ඇමරිකාවේ නිව්යෝර්ක් නගරයද නයගරා ඇල්ලෙන් එම රටවල් දෙක වෙන් වෙන මායිමේ පිහිටි නගර ලෙස හඳුනාගත හැකියි.

එසේම මෙම දිය ඇල්ල ප්‍රධාන කොටස් දෙකක් වශයෙන් හඳුනාගත හැකියි. එහෙත් මෙය Horseshoe Falls, Bridal Veil Falls සහ American Falls යන දියඇලි තුනකින් සමන්විතය. එයින් විශාලම ප්‍රදේශය ලෙස එහි වම්පසට වන්නට පිහිටා තිබෙන කොටස හඳුනා ගත හැකි අතර එය කැනඩාවට අයිති වෙනවා. එය අශ්ව ලාඩමක හැඩය ඇති යයි සැලකෙන අතර එනිසා එය Horseshoe යන නමින් හඳුන්වනු ලබනවා. එය ආසන්න වශයෙන් උසින් අඩි 170වකුත් දිගින් අඩි 2500ක් පමණ වෙනවා. නයගරාවේ අනෙක් කොටස ඇමරිකාවේ නැගෙනහිරට වන්නට පිහිටා ඇති අතර එය ආසන්න වශයෙන් උසින් අඩි 180ක් පමණද දිගින් අඩි 1100ක් පමණද වෙනවා. මත්ස්‍ය වර්ග දිය ඇල්ල හරහා ගමන් කරන අතර ඉන් 90% ක් පමණ ජීවත් වේ. දියඇල්ලෙන් කඩා හැලෙන ජලයෙන් සුදු පැහැති පෙන බුබුළු නිසා ඔවුන්ගේ වැටීම අවහිර වන බව විශේෂඥයෝ පවසති.

නයගරා ඇල්ලට මෙම නම යෙදුන අන්දම සම්බන්ධයෙන් විවිධ අදහස් පවතිනවා. එහිදී 17 වන ශතවර්ෂයේදී මෙම ප්‍රදේශය niagagaregs යන නමින් හඳුන්වා ඇති අතර එනිසා නයගරා යනුවෙන් නම ලැබුණු බව එක් මතයක් වෙනවා. සමහර ගෝත්‍රිකයන් විසින් මෙම ප්‍රදේශය ongniaahra යන නමින් හැඳින්වූ නිසා එම නම ලැබුන බවද, එසේම ඊරි සහ ඔන්ටාරියේ යන විල් අතර වූ මෙම ප්‍රදේශය මිනිස් ගෙලකට සමාන වීම නිසා එයට එම නම ලැබුණු බවද කියවෙනවා.

මෙම දියඇල්ලෙන් ඇද හැලෙන ජලස්කන්ධය වර්තමානයේදී ජල විදුලිය නිපදවීම සඳහාද ප්‍රයෝජනයට ගනු ලබන අතර එමඟින් අත්වනුයේ ඉමහත් ප්‍රයෝජනයකි. සෑම පැයකදිම ජල ගැලුම් බිලියන 5.5 ක් මෙම දිය ඇල්ලෙන් ඇදහැලෙන අතර ඉන් 50%ක් ඇමෙරිකාවේ සහ කැනඩාවේ විදුලිය නිෂ්පාදනය සඳහා යොදාගනු ලබනවා. මිනිත්තුවකට ජල ගැලුම් 6000ක් නයගරා ඇල්ලෙන් කඩා හැලේ. ඇමෙරිකා එක්සත් ජනපදයේ ජල අවශ්‍යතාවයෙන් 20%ක් සපුරාලනු ලබන්නේ නයගරා දියඇල්ලයි. ක්‍රි.ව.1812න් පසුව මෙම ඇල්ල බොහෝ සෙයින් සංචාරකයන්ගේ ආකර්ෂණයට බඳුන් වී තිබෙනවා.


නයගරා ඇල්ල හා බැදුණු අතීත තොරතුරු.

නයගරා ඇල්ල හා බැදුණු අතීතය පිලිබඳව සලකා බලන විට එය වසර 12500 වඩා පැරණි අතීතයකට උරුමකම් කියයි. මුල්ම කාලයේ දී එනම් වසර 18 000කට පමණ පෙර මෙම ප්‍රදේශය කිලෝමීටර 2-3ක් පමණ ඝන අයිස් තට්ටුවකින් වැසී පැවත ඇති අතර කාලයත් සමග ග්ලැසියර දිය වී යාමෙන් මෙම දිය ඇල්ල නිර්මාණය වී තිබෙනවා. 1897 වසරේදී මෙම නයගරා ගංගාව හරහා ආරුක්කු පාලමක් නිර්මාණය කර ඇති අතර එය “whirlpool rapids bridge යන නමින් හඳුන්වනවා.

අද වනවිට මේ පාලම කැනඩාව හා ඇමරිකා එක්සත් ජනපදය අතර මෝටර් රථ, දුම්රිය සහ මගීන්ගේ ගමනාගමනයට විවෘත වෙනවා. එසේම ඇමරිකානු සිවිල් යුද්ධයෙන් පසුව නිව්යෝර්ක් දුම්රිය මාර්ගය සංචාරකයන් හා විවාපත් යුවතිපතින්ට විවෘත වුවා. එසේම මෙම නයගරා ඇල්ල අසල 1950දි ඉදිකරන ලද ඔරලෝසුවක්ද දැක ගැනීමට පිළිවන් වෙනවා.



නයගරා දියඇල්ලේ විශේෂතා.

මෙම දිය ඇල්ලෙහි විශේෂත්වය පිලිබඳව සලකා බලන විට එය රටවල් දෙකක් මෙන්ම ඊරි හා ඔන්ටාරියෝ යන විල්ද සම්බන්ධ කරනවා. නයගරා දියඇල්ල ප්‍රධාන ගංගා පහෙන් හතරක් හරහා ගලා එනු ලබයි. නයගරා දියඇල්ලෙන් නයගරා ගංගාව වෙතද පසුව ඔන්ටේරියෝ, ශාන්ත ලෝරන්ස්, හරහා අවසානයේදී අත්ලාන්තික් සාගරයට ජලය එකතු වෙයි. නයගරා දියඇල්ල ග්රසියරවල ප්‍රතිපලයක් වශයෙන් බිහි වන ලද්දක් වශයෙන්ද සැලකෙනවා. එසේම මෙය උසට වඩා දිගින් වැඩි දිය ඇල්ලක් වන අතර එනිසාම එහි සුන්දරත්වයද වැඩි කරනවා. සවස ඉර බැස යාමත් සමගම එය අලංකාර දසුනක් සංචාරකයන්ගේ නෙත් මානයට ගෙන එනවා. අධික මිදුම සුළඟ මෙන්ම අවට සිසාරා යන ජලබින්දු සහිත මේ පරිසරය චිත්තාකර්ෂණීය සිතුවිලි, පහල කරන ස්ථානයක් බව එය නරඹන ලද බොහෝ දෙනෙකුගේ අදහසයි.

 බොහෝ චිත්‍රපට ආදිය නිර්මාණය කිරීම සඳහා  මෙය යොදාගනු දකින්නට ලැබෙනවා. ‘Super Man’, මැරලින් මොන්රෝ රඟපෑ ‘Niagara’ චිත්‍රපට නයගරා දියඇල්ල අසලදී රූපගත කර තිබෙනවා.

මෙම දිය ඇල්ල තරණය කිරීම සදහා බොහෝ දෙනෙක් උත්සාහ දරා ඇති අතර එයින් බොහෝ දෙනෙක් මියගොස් තිබෙනවා. පසුගිය වසර 10 තුල දෙදෙනෙකු මියගොස් තිබෙනවා. එහෙත් මෙය තරණය කළ පළමු පුද්ගලයා ලෙස සැලකෙන්නේ වයස අවුරුදු 63ක් වූ කාන්තාවක් වන අතර ඒ 1901 වසරේදී යි. මෙම ඇල්ලේ යටි පාශානය වසරකට අඩි 4ක් පමණ බැගින් ඛාදනය වීමට ලක් වෙන අතර ඒ කඩා හැලෙන අධික ජලස්කන්ධය නිසාවෙනි. මේ ආකාරයට සොබාදහමේ සොඳුරු නිර්මාණයක් ලෙස මෙම නයගරා දිය ඇල්ල හදුනා ගැනීමට හැකි වන අතර එය ලෝක සම්පතක්ද වෙනවා.

`
    	})
}));

Nitross.addCommand({pattern: 'gk9 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/9d1d17a6525a3772a1f38.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`*කිංග් කෝබ්‍රා*


කිංග් කෝබ්‍රා යනු elapidae පවුලට අයත් අධික විෂ සහිත විශාල සර්ප විශේෂයකි. ඉන්දියාවේ වනාන්තර හා ඊසානදිග ආසියාවේ ප්‍රදේශ වලට ඒකදේශීය සත්ත්වයෙකි. මොවුන් ලොව වෙසෙන දිගම අධික විෂ සහිත සර්ප විශේෂයයි. වැඩුණු කෝබ්‍රාවන් මීටර් 3.18-4 දක්වා සාමාන්‍ය දිගකට ළඟා වේ. සොයාගෙන තිබෙන දිගම එකාගේ මිනුම මීටර් 5.85කි.

විද්‍යාත්මක නාමය  -  Ophiophagus hannah

සංරක්ෂණ තත්ත්වය  -  අනතුරට ලක්විය හැකි (අඩුවන ගහනය )

ස්කන්ධය  -  6kg

දිග  -     3.18-4m

පවුල  -  Elapidae

උසස් වර්ගීකරණය   -  Ophiophagus

රාජධානිය   -   Animalia

ගෝත්‍රය   -  Scaled reptiles


සාමාන්‍ය බර

කිලෝග්‍රෑම් 6ක්‌ පමණ.
කිංග් කෝබ්‍රාවුන් සාමාන්‍යයෙන් කිලෝග්‍රෑම් 6ක්‌ පමණ ස්කන්ධයකට ළඟාවේ.


 විලෝපිකයන්

කිංග් කෝබ්‍රාගේ ප්‍රධාන සතුරා වන්නේ මුගටියා ය. මක්නිසාද යත් මුගටියන්ට කෝබ්‍රාගේ විෂ බලපාන්නේ නැත. කෙසේවෙතත් කිංග් කෝබ්‍රා ද මුගටියන් සමග සටනට පැමිණියහොත් මිස මුගටියන් මොවුන් සමග සටනට යෑම දුර්ලභ ය.
කිංග් කෝබ්‍රාගේ විෂ දෂ්ටනයකට ලක්වූ මිනිසෙකු මිනිත්තු 45ක්‌ පමණ කාලයක් තුළදී මරණයට පත්වේ.


 අනුවර්තන

මොවුන්ගේ හැසිරීමේ එක අනුවර්තනයක් නම් මොවුන්ගේ දක්ෂතාව වන උඩපැනීමයි. මොවුන්ට මොවුන්ගේ ශරීරයේ දිගෙන් තුනෙන් එකක කොටසකට වන්නට උඩපැනීමට හැකිය. එනම් මොවුන්ට මිනිසා සමග ගත්විට මිනිසාගේ ඇස් වලට සමාන්තරව උඩපැන සිටිය හැක. එලෙස ඇස් වලට සමාන්තරව සිටිමින් සිදුකරන්නේ ඇස් වලට විෂ විදීමයි.
`
    	})
}));

Nitross.addCommand({pattern: 'gkr10 ?(.*)', fromMe: false, dontAddCommandList: true}, (async (message, match) => {

    var respoimage = await axios.get(`https://telegra.ph/file/575e19e0278a18684c0cf.jpg`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: 

    	`*👳🏾‍♀️මහාත්මා ගාන්ධි👳🏾‍♀️*

🫂මෝහන්දාස් කරම්චන්ද් ගාන්ධි යනු ඉන්දියානු නීතීඥයෙක්, යටත්විජිත විරෝධී ජාතිකවාදියෙක් සහ දේශපාලන සදාචාරයෙකි, ඔහු බ්‍රිතාන්‍ය පාලනයෙන් ඉන්දියාව නිදහස් කර ගැනීමේ ව්‍යාපාරය සාර්ථකව මෙහෙයවීමට අවිහිංසාවාදී ප්‍රතිරෝධයක් දැක්වීය. ඒ සමඟම ලොව පුරා සිවිල් අයිතිවාසිකම් සහ නිදහස සඳහා වූ ව්‍යාපාර දිරිගැන්වීය. 1914 දී දකුණු අප්‍රිකාවේදී ඔහුට මුලින්ම භාවිතා කරන ලද ගෞරවනීය මහත්මා දැන් ලොව පුරා භාවිතා වේ

🫂ගජරාටයේ වෙරළබඩ හින්දු පවුලක ඉපිද හැදී වැඩුණු ගාන්ධි ලන්ඩනයේ ඉනර් පන්සලේදී නීතිය පිළිබඳ පුහුණුව ලැබූ අතර 1891 ජුනි මාසයේදී වයස අවුරුදු 22 දී බාර්එක වෙත කැඳවනු ලැබීය. ඉන්දියාවේ අවිනිශ්චිත වසර දෙකකට පසු, ඔහුට සාර්ථක ආරම්භයක් ලබා ගැනීමට නොහැකි විය. නීති පුහුණුව, ඔහු 1893 දී දකුණු අප්‍රිකාවට ගොස් නඩුවකට ඉන්දියානු වෙළෙන්දෙකු නියෝජනය කළේය. ඔහු වසර 21 ක් දකුණු අප්‍රිකාවේ ජීවත් විය. දකුණු අප්‍රිකාවේදී ගාන්ධි පවුලක් ඇති දැඩි කළ අතර සිවිල් අයිතිවාසිකම් සඳහා වූ ව්‍යාපාරයකදී මුලින්ම අවිහිංසාවාදී ප්‍රතිරෝධයක් දැක්වීය. 1915 දී වයස අවුරුදු 45 දී ඔහු නැවත ඉන්දියාවට පැමිණියේය. අධික ඉඩම් බදු හා වෙනස් කොට සැලකීම් වලට එරෙහිව ගොවීන්, ගොවීන් සහ නාගරික කම්කරුවන් සංවිධානය කිරීමට ඔහු පියවර ගත්තේය. 1921 දී ඉන්දියානු ජාතික කොංග්‍රසයේ නායකත්වය භාර ගනිමින් ගාන්ධි දිළිඳුකම පිටුදැකීම, කාන්තා අයිතිවාසිකම් පුළුල් කිරීම, ආගමික හා ජනවාර්ගික සුහදතාව ගොඩනැගීම, නොපැහැදිලිභාවය අවසන් කිරීම සහ සියල්ලටම වඩා ස්වරාජ් හෝ ස්වයං පාලනය සාක්ෂාත් කර ගැනීම සඳහා රට පුරා උද්ඝෝෂණ මෙහෙයවීය.

🫂1921 දී ගාන්ධි ඉන්දියාවේ ග්‍රාමීය දුප්පතුන් හඳුනා ගැනීමේ ලකුණක් වශයෙන් සාම්ප්‍රදායික ඉන්දියානු කැරකෙන රෝදයක (චර්කා) නූල් වලින් අතින් වියන ලද ඉන්දියානු ලොම් රෙද්දක් (කෙටි දෝති) සහ සළුවක් (ශීත සෘතුවේදී) භාවිතා කිරීම භාර ගත්තේය. ඔහු ස්වයං පෝෂිත නේවාසික ප්‍රජාවක නිහතමානීව ජීවත් වීමට පටන් ගත් අතර සරල නිර්මාංශ ආහාර අනුභව කළ අතර ස්වයං පිරිසිදු කිරීමේ සහ දේශපාලන විරෝධය දැක්වීමේ මාධ්‍යයක් ලෙස දිගු උපවාසයන් කළේය. සාමාන්‍ය ඉන්දියානුවන් වෙත යටත්විජිත විරෝධී ජාතිකවාදය ගෙන ඒම සඳහා ගාන්ධි විසින් බ්‍රිතාන්‍යයන් විසින් පනවා තිබූ ලුණු බද්දට අභියෝග කරමින් කි.මී 400 (සැතපුම් 250) දණ්ඩී ලුණු මාර්තු 1930 දී සහ 1942 දී බ්‍රිතාන්‍යයින්ට ඉන්දියාවෙන් ඉවත් වන ලෙස ඉල්ලා සිටීම සඳහා නායකත්වය දුන්නේය. දකුණු අප්‍රිකාවේ මෙන්ම ඉන්දියාවේද වසර ගණනාවක් සහ වසර ගණනාවක් තිස්සේ.

🫂ආගමික බහුත්වවාදය මත පදනම් වූ ගාන්ධිගේ නිදහස් ඉන්දියාව පිළිබඳ දැක්ම 1940 ගණන් වල මුල් භාගයේදී අභියෝගයට ලක් වූයේ ඉන්දියාවෙන් කැටයම් කළ වෙනම මුස්ලිම් නිජබිමක් ඉල්ලා සිටි නව මුස්ලිම් ජාතිකවාදයක් මගිනි. 1947 අගෝස්තු මාසයේදී බ්‍රිතාන්‍යය නිදහස ලබා දුන් නමුත් බ්‍රිතාන්‍ය ඉන්දියානු අධිරාජ්‍යය හින්දු බහුතරයක් වූ ඉන්දියාව සහ මුස්ලිම් බහුතරයක් වූ පාකිස්තානය යන ආධිපත්‍ය දෙකකට බෙදුණි. බොහෝ අවතැන් වූ හින්දු, මුස්ලිම් සහ සික් ජාතිකයින් ඔවුන්ගේ නව ඉඩම් වූ ආගමික හිංසනය කරා ගමන් කළහ. විශේෂයෙන් පන්ජාබ් සහ බෙංගාලයේ පුපුරා ගියේය. දිල්ලියේ නිදහස නිල වශයෙන් සැමරීම අතහැර ගාන්ධි විපතට පත් ප්‍රදේශ වෙත ගොස් සැනසීම ලබා දීමට උත්සාහ කළේය. ඊළඟ මාස කිහිපය තුළ ඔහු ආගමික හිංසනය නැවැත්වීම සඳහා උපවාස කිහිපයක් ආරම්භ කළේය. 1948 ජනවාරි 12 දින ඔහුට 78 වැනි වියේදී සිදු කරන ලද මේවායින් අවසන් වරට පකිස්ථානයට ගෙවිය යුතු මුදල් වත්කම් කිහිපයක් ගෙවන ලෙසට ඉන්දියාවට බලපෑම් කිරීමේ වක්ර ඉලක්කය ද විය. සමහර ඉන්දියානුවන් සිතුවේ ගාන්ධි ඕනෑවට වඩා ඉඩ දෙන බවයි. ඔවුන් අතර 1948 ජනවාරි 30 දින ගාන්ධිගේ පපුවට වෙඩි උණ්ඩ තුනක් එල්ල කර ඝාතනය කළ හින්දු ජාතිකවාදියෙකු වූ නතුරාම් ගොඩ්සේ ද විය.

*🇮🇳ගාන්ධිගේ උපන් දිනය වන ඔක්තෝබර් 2 වන දින ඉන්දියාවේ ජාතික නිවාඩු දිනයක් වන ගාන්ධි ජයන්තිය ලෙසත් ලොව පුරා ජාත්‍යන්තර අවිහිංසාවාදී දිනය ලෙසත් සමරනු ලබයි. ගාන්ධි සාමාන්‍යයෙන් විධිමත් ලෙස නොවුනත් ඉන්දියාවේ ජාතියේ පියා ලෙස සැලකේ🇮🇳*

මුලාශ්‍රය - Wikipedia 

*#General Knowledge*`

    	})
}));
